{
  "Animals": [
    {
      "idiom": "(it's) raining cats and dogs",
      "meaning": "You can say \"it's raining cats and dogs\" if it's raining very hard.",
      "examples": [
        "We can't go now because it's raining cats and dogs.",
        "Why do people always use \"it's raining cats and dogs\" as an example of an idiom? No-one actually uses it any more, do they?"
      ]
    },
    {
      "idiom": "(like) water off a duck's back",
      "meaning": "You can say an insult or criticism is like water off a duck's back if it doesn't upset you.",
      "examples": [
        "I asked Amy if she got upset when journalists wrote negative things about her, and she said she didn't care what they wrote - it was like water off a duck's back.",
        "Terry said he was too sensitive about criticism and he wanted to be like one of those people for whom it's like water off a duck's back."
      ]
    },
    {
      "idiom": "a night owl",
      "meaning": "You're a night owl if you like to stay up and do things late at night.",
      "examples": [
        "She's always been a night owl. Even when she was a student she'd study late at night and get up as late as possible the next day.",
        "I don't know why I'm a night owl. I just seem more alert at night, and even if I go to bed early I can't get to sleep till about 3 in the morning."
      ]
    },
    {
      "idiom": "a queer fish",
      "meaning": "If someone's a queer fish, they are a bit strange and can sometimes behave in an unusual way.",
      "examples": [
        "Your great grandfather was a queer fish, Johnny. He used to write funny poems and then he'd read them aloud to everyone on the train on his way to work.",
        "Some of the characters described as \"queer fish\" in old novels might be called \"weirdos\" these days."
      ]
    },
    {
      "idiom": "a whale of a time",
      "meaning": "If you have a whale of a time, you have a great time and really enjoy yourself.",
      "examples": [
        "I went to a karaoke club with my friends last night and we had a whale of a time. It was great!",
        "Janet said she had a whale of a time at the party. I wish I'd gone too now."
      ]
    },
    {
      "idiom": "a wolf in sheep's clothing",
      "meaning": "A wolf in sheep's clothing is someone who seems to be a good person but is really a bad person.",
      "examples": [
        "The priest at our church seemed to be a very warm and caring man, but we later found out that he was a wolf in sheep's clothing.",
        "People in our town suspected that Henry was a wolf in sheep's clothing, but I think they were wrong."
      ]
    },
    {
      "idiom": "can of worms",
      "meaning": "If you say a situation or an issue is a can of worms, you think that getting involved in it could lead to problems.",
      "examples": [
        "Corruption in politics is such a can of worms that many journalists won't take the risk of seriously investigating it.",
        "Cathy never talks about her childhood. She says it's a can of worms she doesn't want to open, though I have no idea why."
      ]
    },
    {
      "idiom": "chickens come home to roost",
      "meaning": "If chickens are coming home to roost, someone is suffering the unpleasant consequences of their bad actions in the past.",
      "examples": [
        "Fred's in hospital with liver problems. I guess the chickens have come home to roost after all those years of heavy drinking.",
        "The chickens are coming home to roost for the executives who committed fraud in the nineties. They're being charged now even though they committed their crimes over ten years ago."
      ]
    },
    {
      "idiom": "drink like a fish",
      "meaning": "If someone drinks like a fish, they drink a lot of alcohol.",
      "examples": [
        "Since he got back from the war Billy's been drinking like a fish, and we think he needs some help.",
        "Some people might say I drink like a fish, but I don't think I drink too much."
      ]
    },
    {
      "idiom": "eyes like a hawk",
      "meaning": "If someone has eyes like a hawk, they have very good eyesight and they notice everything.",
      "examples": [
        "One of the president's bodyguards is over sixty, but he's still got eyes like a hawk. Just last year he spotted a guy pulling out a gun fifty yards away, and saved the president's life by pushing him to the ground.",
        "You need eyes like a hawk to be a line judge at Wimbledon, especially these days when the top tennis players hit the ball so fast."
      ]
    },
    {
      "idiom": "kill two birds with one stone",
      "meaning": "If you kill two birds with one stone, you achieve two things with the one action.",
      "examples": [
        "I need to go to the bank, and if I drop the books off at the library on the way I'll be killing two birds with one stone.",
        "Jenny says that she kills two birds with one stone if she does her own housework because she gets the house clean and she gets some exercise at the same time."
      ]
    },
    {
      "idiom": "let the cat out of the bag",
      "meaning": "If you let the cat out of the bag, you let someone know a secret.",
      "examples": [
        "We'd planned a surprise party for Donna, but some guy she works with let the cat out of the bag, so now she knows.",
        "Don't forget that this is a secret, so whatever you do, don't let the cat out of the bag."
      ]
    },
    {
      "idiom": "like a fish out of water",
      "meaning": "You feel like a fish out of water if you're surrounded by people who are different to you, and it's making you feel a little uncomfortable.",
      "examples": [
        "I was the only black person in a church full of white people, and I felt like a fish out of water at first. But lots of people came up and talked to me after the service, and I soon felt quite at home.",
        "Sayoko travels to a lot of unusual places. She says feeling like a fish out of water is sometimes interesting."
      ]
    },
    {
      "idiom": "quiet as a mouse",
      "meaning": "If you're as quiet as a mouse, you're very quiet.",
      "examples": [
        "I didn't hear you come in last night. You must have been as quiet as a mouse.",
        "Nadia has been as quiet as a mouse in class since everyone laughed when she said the wrong thing."
      ]
    },
    {
      "idiom": "sick as a dog",
      "meaning": "If you're as sick as a dog, you're very sick.",
      "examples": [
        "I've been as sick as a dog since I ate those sausage rolls.",
        "Helen hates to miss work, so she really must be sick as a dog if she isn't here."
      ]
    },
    {
      "idiom": "take the bull by the horns",
      "meaning": "If you take the bull by the horns, you deal with a problem or a challenge in a direct and fearless way.",
      "examples": [
        "Pauline wasn't happy with the manager's decision, so she took the bull by the horns and demanded to see him in order to discuss the matter.",
        "The magazine's sales were falling, so the owner took the bull by the horns and replaced the editor, had the layout redesigned, and brought in new writers."
      ]
    },
    {
      "idiom": "talk turkey",
      "meaning": "If you talk turkey, you discuss something seriously, usually to do with business or money.",
      "examples": [
        "After the owner had shown him around the apartment, Shane decided it was just what he wanted, so he said, \"OK, I'm interested. Let's talk turkey.\"",
        "I started to say something about the deal, but Mr Hamilton said, \"Not now, my boy. We never talk turkey at the dinner table.\""
      ]
    },
    {
      "idiom": "the lion's share",
      "meaning": "You can say something is the lion's share if it's the biggest share or portion of something.",
      "examples": [
        "The lion's share of the government's budget goes to the military, when it could be spent on useful things like education, health care and looking after the environment.",
        "The company executives decided to give the lion's share of the company's profits to themselves, in the form of very high salaries, huge bonuses and very generous expense accounts. Not much was left over for staff wages and the shareholders."
      ]
    },
    {
      "idiom": "the rat race",
      "meaning": "The rat race is the highly competitive and stressful world of work and business.",
      "examples": [
        "Sally is sick of the rat race. She's going to quit her job in London and move to a quiet village and open a small cafe.",
        "My uncle says that success in the rat race can make you rich, but it can also turn you into a self-centred and shallow person."
      ]
    },
    {
      "idiom": "zebra crossing",
      "meaning": "A zebra crossing is a pedestrian crossing that is marked on the road with painted black and white stripes.",
      "examples": [
        "Visitors to Britain are sometimes confused when they're told there's a zebra crossing up ahead. Some even expect to see a zebra walking across the road.",
        "If someone steps onto a zebra crossing, all cars must stop and wait for them to cross the road."
      ]
    }
  ],
  "Body": [
    {
      "idiom": "(have) egg on your face",
      "meaning": "You will have egg on your face if you've said or done something wrong, and it's made you feel embarrassed or stupid.",
      "examples": [
        "Stan had egg on his face after saying he could easily do fifty push-ups, and then giving up after  doing just twenty.",
        "The police force had egg on its face because they arrested and beat up an innocent guy who had the same name as a suspect they were looking for."
      ]
    },
    {
      "idiom": "(your) hands are tied",
      "meaning": "You can say your hands are tied if you're prevented from doing something that you'd normally have the power or the authority to do.",
      "examples": [
        "The president says he'd like to spend more on schools in poor districts, but says his hands are tied by what he calls \"budgetary restrictions\".",
        "I'd really like to give you the contract, Mr Gambino, but my hands are tied because of those laws on giving contracts to people with criminal records."
      ]
    },
    {
      "idiom": "(your) heart goes out to (someone)",
      "meaning": "If your heart goes out to someone, you feel great sympathy for them.",
      "examples": [
        "We're so sorry to hear of your loss, and our hearts go out to you in this difficult time.",
        "My heart went out to Kerry when I heard that her dog had died. I know how much she loved him."
      ]
    },
    {
      "idiom": "(your) heart is in the right place",
      "meaning": "If your heart is in the right place, you try to do the right thing, even if things don't always work out for the best.",
      "examples": [
        "His heart was in the right place when he raised everyone's salaries, but in the end it meant some people lost their jobs.",
        "Bill's heart's in the right place, and he means well, but he sometimes upsets people by being too direct when he speaks."
      ]
    },
    {
      "idiom": "(your) heart isn't in it",
      "meaning": "If your heart isn't in something you're doing, you don't really want to do it.",
      "examples": [
        "Ali was studying to be a doctor, but his heart wasn't in it so he decided to follow his real dream and study film-making instead.",
        "We could tell that Sally's heart wasn't in it when she tried singing jazz, so we said she should stick to pop songs."
      ]
    },
    {
      "idiom": "a bad hair day",
      "meaning": "If you're having a bad hair day, everything seems to be going wrong for you.",
      "examples": [
        "Poor Sue's in a terrible mood. I think she's having a bad hair day.",
        "I knew it was going to be a bad hair day when my car wouldn't start."
      ]
    },
    {
      "idiom": "a gut feeling",
      "meaning": "If you have a gut feeling, you sense something about a person or a situation, without knowing why, but you're sure what you sense is true.",
      "examples": [
        "As soon as I came into the room I had a gut feeling that something was wrong - and then I saw the dead body.",
        "Chaz said his gut feeling was that Laura was lying and, sure enough, she was."
      ]
    },
    {
      "idiom": "a head start",
      "meaning": "If you have a head start, you start something ahead of others or with an advantage over others.",
      "examples": [
        "If you're born into a rich family, and you've had a good education, you're lucky enough to have had a head start in life, so don't waste it.",
        "Marylin's beauty and natural grace gave her a big head start in the modelling and acting business."
      ]
    },
    {
      "idiom": "a kick in the teeth",
      "meaning": "If you get a kick in the teeth, something bad happens to you or you feel that you've been treated poorly.",
      "examples": [
        "I'd just lost my job, so hearing that I had to move out of my apartment as well was a real kick in the teeth.",
        "Gerry said that being told to get out of his apartment was a kick in the teeth after spending so much on doing it up."
      ]
    },
    {
      "idiom": "a knuckle sandwich",
      "meaning": "If you give someone a knuckle sandwich, you punch them.",
      "examples": [
        "If you say that again you'll get a knuckle sandwich!",
        "Simon said he'd give me a knuckle sandwich if I wasn't careful, so I said \"Come on then, let's go outside!\""
      ]
    },
    {
      "idiom": "a pain in the neck",
      "meaning": "You can say someone is a pain in the neck if they annoy you, or something is a pain in the neck if you don't like doing it.",
      "examples": [
        "Lenny's being a pain in the neck today. He keeps interrupting me while I'm trying to work.",
        "It's a real pain in the neck when you're trying to get some sleep on the train and people keep shouting into their mobile phones all around you."
      ]
    },
    {
      "idiom": "a pat on the back",
      "meaning": "You've given someone a pat on the back if you've told them they've done something well, or done a good job.",
      "examples": [
        "Don't you think Salim deserves a pat on the back for his report? Why don't you tell him it was excellent work?",
        "Our boss doesn't often praise us for our work, so if he gives you a pat on the back for something, you've really earned it."
      ]
    },
    {
      "idiom": "a shot in the arm",
      "meaning": "You can say something is a shot in the arm if it gives a person or an organisation renewed energy or enthusiasm.",
      "examples": [
        "Getting a grant from the Arts Council was a much-needed shot in the arm for the orchestra.",
        "We all agree that the economy needs a shot in the arm, but we can't agree on exactly what it should be."
      ]
    },
    {
      "idiom": "a sight for sore eyes",
      "meaning": "If something or someone is a sight for sore eyes, you are glad to see them.",
      "examples": [
        "It's been raining here for a week, so it sure was a sight for sore eyes when we saw the sun this morning.",
        "Hey, Ozzie! You're a sight for sore eyes, man. Haven't seen you for ages."
      ]
    },
    {
      "idiom": "a skeleton in the cupboard | closet",
      "meaning": "If you have a skeleton in the cupboard, or in the closet, you have a secret in your past which could damage you if it became known.",
      "examples": [
        "Before we give you the job, we need to know if you have any skeletons in the cupboard which the press could find out about. Things like a criminal record or drug or alcohol problems in the past.",
        "Politicians can't afford to have any skeletons in the closet these days. Their enemies are sure to find them."
      ]
    },
    {
      "idiom": "a slap on the wrist",
      "meaning": "If someone gives you a slap on the wrist, they give you a mild punishment for making a mistake or doing something wrong.",
      "examples": [
        "The tribunal didn't think it was a serious offence, so they just gave him a slap on the wrist. All he got was a warning.",
        "Some of our players got a slap on the wrist for getting to the training session late. The coach warned them not to be late again and then made them do twenty push-ups."
      ]
    },
    {
      "idiom": "a slip of the tongue",
      "meaning": "If you make a slip of the tongue, you make a small mistake when speaking.",
      "examples": [
        "I really meant to say Miss Davis, not Mrs Davis, so it was just a slip of the tongue, but Judy thought I was teasing her.",
        "A newsreader made a slip of the tongue when reading out the scores. He said Chelsea had lost by a goal, instead of saying they'd won by a goal."
      ]
    },
    {
      "idiom": "a weight off your shoulders",
      "meaning": "You can say a weight is off your shoulders if you no longer have to worry about something or deal with something difficult.",
      "examples": [
        "Thanks so much for agreeing to take care of Snoopy while I'm away. It's a weight off my shoulders knowing that a real dog lover will be looking after her.",
        "I think it was a real weight off Cathy's shoulders when you offered to take care of the arrangements. She's got so much else to deal with at the moment."
      ]
    },
    {
      "idiom": "Achilles' heel",
      "meaning": "An Achilles' heel is a weakness that could result in failure.",
      "examples": [
        "He's a good golfer, but his Achilles' heel is his putting and it's often made him lose matches.",
        "The country's dependence on imported oil could prove to be its Achilles' heel if prices keep on rising."
      ]
    },
    {
      "idiom": "an eye-opener",
      "meaning": "You can say something's an eye-opener if it's made you realize something you hadn't been aware of before.",
      "examples": [
        "Al Gore's movie \"An Inconvenient Truth\" was a real eye-opener for me. I hadn't really understood how serious global warming was until I saw it.",
        "Cathy said her trip to Thailand was quite an eye-opener for her. She'd never realized before how beautiful Thailand was, or how friendly the people were."
      ]
    },
    {
      "idiom": "behind someone's back",
      "meaning": "If you do something behind someone's back, you do it without letting them know about it.",
      "examples": [
        "We've taught our kids that it's impolite to talk about people behind their backs.",
        "The nurses had to go behind the doctor's back when they reported him for drinking alcohol before doing operations."
      ]
    },
    {
      "idiom": "bite your tongue | hold your tongue",
      "meaning": "If you bite your tongue, or hold your tongue, you force yourself not to say something you really want to say.",
      "examples": [
        "I wanted to tell Carlos he was being stupid, but I bit my tongue and just sat there.",
        "You're going to have to learn to hold your tongue instead of saying whatever comes into your head."
      ]
    },
    {
      "idiom": "break your heart",
      "meaning": "If someone breaks your heart, they cause you a lot of emotional pain by ending a romantic relationship, or by deeply hurting you in some other way.",
      "examples": [
        "I loved Monty, and he broke my heart when he left me and went off with someone else.",
        "Sue says her heart has been broken too many times, and she won't let herself fall in love again."
      ]
    },
    {
      "idiom": "by word of mouth",
      "meaning": "If something becomes well-known by word of mouth, it becomes well-known because people are telling each other about it, and not because of advertising or other marketing tools.",
      "examples": [
        "Word of mouth made this movie a hit. A few people saw it and told their friends about it, and then they told more people about it, and before long everyone was going to see it.",
        "The best possible marketing tool is word of mouth, but a product has to be extremely good to earn it."
      ]
    },
    {
      "idiom": "caught red-handed",
      "meaning": "If someone is caught red-handed, they are caught in the act of doing something wrong such as cheating or stealing.",
      "examples": [
        "I used to cheat in exams until I was caught red-handed by my teacher. I stopped doing it after that.",
        "How can you say you didn't steal the book? You were caught red-handed walking out of the store after you'd hidden it under your jacket."
      ]
    },
    {
      "idiom": "come to your senses",
      "meaning": "If you come to your senses, you see things clearly and begin to act sensibly after a period of confusion and unwise behaviour.",
      "examples": [
        "It took him a while, but Bill has finally come to his senses and stopped drinking too much alcohol.",
        "Kerry says it's time we came to our senses and started treating our planet with the sort of love and care it needs."
      ]
    },
    {
      "idiom": "dig your heels in",
      "meaning": "If you dig your heels in, you stubbornly resist something or refuse to change.",
      "examples": [
        "Even though the developer offered them more than their houses were worth, the owners dug their heels in and refused to sell up and make way for the office block.",
        "When their record company told the band to change their style and make more commercial music, the band dug their heels in and refused to change."
      ]
    },
    {
      "idiom": "drag your feet | drag your heels",
      "meaning": "If you drag your feet, or drag your heels, you do something slowly because you don't really want to do it.",
      "examples": [
        "The government promised to provide universal health care, but now it's dragging its feet over the issue.",
        "We expected the company to drag its heels when it came to paying compensation to the injured workers, but now it doesn't want to pay anything!"
      ]
    },
    {
      "idiom": "ear to the ground",
      "meaning": "If you have your ear to the ground, you know what's really going on in a situation.",
      "examples": [
        "If we want to market to teenagers, we need someone with an ear to the ground who really knows what they want these days.",
        "I've got this great stockbroker who's got his ear to the ground and always knows when to buy or sell stocks."
      ]
    },
    {
      "idiom": "easy on the eye",
      "meaning": "If something is easy on the eye, it is pleasant to look at.",
      "examples": [
        "Do you like paintings that are challenging and say something, or paintings that are easy on the eye and work as decoration?",
        "We want some wallpaper that's easy on the eye but still brightens up the room."
      ]
    },
    {
      "idiom": "elbow grease",
      "meaning": "If something needs elbow grease, it needs a lot of hard physical work.",
      "examples": [
        "We'll need a bit more elbow grease to get these walls really clean.",
        "The secret of a really shiny car is turtle wax and elbow grease."
      ]
    },
    {
      "idiom": "eyes like a hawk",
      "meaning": "If someone has eyes like a hawk, they have very good eyesight and they notice everything.",
      "examples": [
        "One of the president's bodyguards is over sixty, but he's still got eyes like a hawk. Just last year he spotted a guy pulling out a gun fifty yards away, and saved the president's life by pushing him to the ground.",
        "You need eyes like a hawk to be a line judge at Wimbledon, especially these days when the top tennis players hit the ball so fast."
      ]
    },
    {
      "idiom": "face to face",
      "meaning": "If people meet face to face, they meet in person in the real world.",
      "examples": [
        "We became friends after meeting online in a chat room, but we've never actually met face to face.",
        "We always need to have a face-to-face interview with a job applicant before making a final decision."
      ]
    },
    {
      "idiom": "feel the pinch",
      "meaning": "If you are feeling the pinch, you're finding it harder to survive on your income.",
      "examples": [
        "Since the price of oil went up, lots of businesses have been feeling the pinch.",
        "Inflation has been pretty bad recently, so we've all been feeling the pinch."
      ]
    },
    {
      "idiom": "find your feet",
      "meaning": "If you're still finding your feet, you're still adjusting to a new place or a new situation.",
      "examples": [
        "It takes a while to find your feet when you start a new job, but you'll soon figure out who's who and what's what.",
        "Gary's been studying here for three months and he still hasn't found his feet. Maybe he should try something else."
      ]
    },
    {
      "idiom": "get it off your chest",
      "meaning": "If you get it off your chest, you tell somebody about something that's been bothering you and you've been thinking about a lot.",
      "examples": [
        "I can see that something's upsetting you, so why don't you get it off your chest and tell me what it is. You'll feel better if you do.",
        "Charlie was feeling bad about cheating on his wife, so he got it off his chest and told her about it. She divorced him soon after."
      ]
    },
    {
      "idiom": "get off on the wrong foot",
      "meaning": "If you get off on the wrong foot, you start something poorly, or begin with a mistake.",
      "examples": [
        "I got off on the wrong foot in my new job when I forgot to pass on an important message to the boss.",
        "Helen got off on the wrong foot in her performance when she forgot the first few words of the song."
      ]
    },
    {
      "idiom": "go over your head",
      "meaning": "If someone goes over your head, they go to someone with more authority than you in order to get something that you would normally grant, possibly because they think you won't give it to them.",
      "examples": [
        "He knew I wouldn't give him time off, so he went over my head and asked my boss.",
        "I wouldn't go over her head if I were you. It'll make her angry, and next time you ask her for something she might say no."
      ]
    },
    {
      "idiom": "grease someone's palm",
      "meaning": "If you grease someone's palm, you pay them a bribe.",
      "examples": [
        "The only way to get a government contract around here is to grease someone's palm.",
        "If you want to get out of jail, grease the warden's palm and the guards will let you escape."
      ]
    },
    {
      "idiom": "hard to swallow",
      "meaning": "Something that someone has said is hard to swallow if it's difficult to believe.",
      "examples": [
        "His excuse for coming late was a bit hard to swallow, don't you think?",
        "I find a lot of Jack's stories hard to swallow, but I still enjoy hearing them even if they aren't entirely true."
      ]
    },
    {
      "idiom": "have a heart-to-heart",
      "meaning": "If you have a heart-to-heart with someone, you have an honest talk and share your feelings with each other.",
      "examples": [
        "After we'd had a good heart-to-heart we understood each other much better.",
        "If you're not getting on well with someone, having a heart-to-heart can really help a lot."
      ]
    },
    {
      "idiom": "have your hands full",
      "meaning": "If you have your hands full, you're busy.",
      "examples": [
        "I'd love to teach you but I've got my hands full at the moment and I can't take on any more students just now.",
        "Marianne has her hands full raising her kids, so she won't be working again until they're all in school."
      ]
    },
    {
      "idiom": "have your head in the clouds",
      "meaning": "If someone has their head in the clouds, they are out of touch with the everyday world and can be unrealistic or naive as a result.",
      "examples": [
        "If you think oil companies are going to help destroy their own industry by developing alternative energy sources, you have your head in the clouds.",
        "Janette must have her head in the clouds if she thinks her insurance company is going to pay the full cost of rebuilding and refurnishing her house."
      ]
    },
    {
      "idiom": "heads will roll",
      "meaning": "You can say \"heads will roll\" if people are going to lose their jobs after making a mistake.",
      "examples": [
        "How could the air force have bombed a school by mistake? Heads will roll, believe me!",
        "Have you any idea how much money this mistake will cost the company? You can be sure that heads will roll."
      ]
    },
    {
      "idiom": "hold your head high | hold your head up high",
      "meaning": "You can hold your head high, or hold your head up high, if you feel proud of something.",
      "examples": [
        "The team didn't win, but they can hold their heads up high because they put up a great fight.",
        "Al said, \"Will our generation be able to hold our heads high if we've created serious environmental problems for our grandchildren to deal with? I don't think so!\""
      ]
    },
    {
      "idiom": "It's written all over your face.",
      "meaning": "If you say \"it's written all over your face\", you're saying that the expression on someone's face is showing their true feelings or thoughts.",
      "examples": [
        "I knew my son had stolen the money. The guilt was written all over his face.",
        "I can tell something amazing has happened. It's written all over your face. Tell me what it is!"
      ]
    },
    {
      "idiom": "itchy feet",
      "meaning": "If you have itchy feet, you feel the need to go somewhere different or do something different.",
      "examples": [
        "It's no wonder Ken's got itchy feet. He's been doing the same job, in the same office, for nearly twenty years.",
        "Thanks to low-cost airlines, people with itchy feet who couldn't afford air fares in the past can now travel."
      ]
    },
    {
      "idiom": "joined at the hip",
      "meaning": "If two people or things are joined at the hip, they're so closely linked as to be almost inseparable.",
      "examples": [
        "Kim and Meg have been joined at the hip since meeting in high school.  They're more like soulmates than friends.",
        "The two clubs were so closely tied after sharing the same ground and the same staff for so long that they were practically joined at the hip."
      ]
    },
    {
      "idiom": "jump down your throat | jump all over you",
      "meaning": "If someone jumps down your throat, or jumps all over you, they strongly criticise you or scold you.",
      "examples": [
        "All I did was come twenty minutes late, and the manager jumped down my throat. I don't understand why he got so mad.",
        "Janie's parents jumped all over her for forgetting to call them and tell them she'd be getting home late."
      ]
    },
    {
      "idiom": "jump out of your skin",
      "meaning": "You jump out of your skin when something suddenly shocks you and your whole body jumps.",
      "examples": [
        "Luke was watching the clouds pass in front of the moon when I quietly snuck up behind him and tapped him on the shoulder. He screamed and nearly jumped out of his skin!",
        "Ollie didn't know I was making some toast, and when it suddenly popped up just as he was walking past he jumped out of his skin. It was really funny!"
      ]
    },
    {
      "idiom": "keep an eye on",
      "meaning": "If you keep an eye on someone, you make sure you know what they're doing.",
      "examples": [
        "I'm a bit worried about Hannah's health so could you keep an eye on her while I'm away.",
        "The media has promised to keep an eye on the new government and report anything that seems suspicious."
      ]
    },
    {
      "idiom": "keep your nose clean",
      "meaning": "If you keep your nose clean, you stay out of trouble by making sure you don't do anything wrong.",
      "examples": [
        "Our son Michael is in trouble with the police again. I really wish he'd learn to keep his nose clean.",
        "It's important for sport's stars to keep their noses clean because they make a lot of money for endorsing products, and they could lose this income if they got into trouble with the law."
      ]
    },
    {
      "idiom": "lend someone a hand",
      "meaning": "If you lend someone a hand, you help them.",
      "examples": [
        "Could you lend me a hand with these bags?",
        "Sue's husband is amazing. He'll even lend a hand in the kitchen when she's cooking for a dinner party!"
      ]
    },
    {
      "idiom": "let your hair down",
      "meaning": "If you let your hair down, you enjoy yourself by doing whatever you feel like doing and not worrying about what other people might think.",
      "examples": [
        "It's hard to imagine Francine letting her hair down and having fun, but Helen said she's like another person when she's not at work. She's funny and lively and she knows how to have a good time.",
        "Come on, George! It's Saturday night so why don't you stop being so serious and sensible and let your hair down for a change?"
      ]
    },
    {
      "idiom": "lose face",
      "meaning": "If you lose face, your status falls and you aren't   respected as much as you were.",
      "examples": [
        "A good manager can let someone know they've made a mistake without causing them to lose face.",
        "Ali's spoken English isn't improving because he thinks he'll lose face if he makes a mistake, so he never says anything. And of course the only way to get better at speaking is to practise."
      ]
    },
    {
      "idiom": "lose your head",
      "meaning": "If you lose your head, you become very angry about something.",
      "examples": [
        "When some people at the hospital said they wouldn't help my injured friend because he didn't have his ID card, I lost my head and shouted, \"What's wrong with you people? He's dying!\"",
        "If you're in a government office and an official is making life difficult for you, try not to lose your head. It won't help if you shout at them."
      ]
    },
    {
      "idiom": "more than meets the eye",
      "meaning": "You can say there's more to something than meets the eye if it's more complex, more important or more interesting than it seems at first.",
      "examples": [
        "I'm sure there's more going on here than meets the eye. I don't think we've been told the full story.",
        "Mick might seem dull and boring when you meet him, but there's more to him than meets the eye, believe me! He's a really interesting guy."
      ]
    },
    {
      "idiom": "music to your ears",
      "meaning": "If something is music to your ears, it's just what you want to hear.",
      "examples": [
        "When Halle heard Jason say \"I do\" at their wedding, it was music to her ears.",
        "After I'd done my final dive, the judges all said 9.9 or 10 and the crowd cheered. It was music to my ears!"
      ]
    },
    {
      "idiom": "neck and neck",
      "meaning": "If two competitors are running neck and neck in a race, they are almost level.",
      "examples": [
        "Nearly all the votes have been counted and the two candidates are still neck and neck, so we don't know who's won the election yet.",
        "The horses were neck and neck as they crossed the finishing line, so the judges have called for a photo."
      ]
    },
    {
      "idiom": "nerves of steel",
      "meaning": "If you have nerves of steel, you are very brave and not many things make you scared or nervous.",
      "examples": [
        "I could never work on one of those high-rise building sites where you walk along beams about twenty stories up. You'd need nerves of steel to do that job.",
        "Those people who sing the national anthem before one of those big sporting events must have nerves of steel."
      ]
    },
    {
      "idiom": "off the top of your head",
      "meaning": "If you give someone information off the top of your head, you do so from memory, without checking beforehand.",
      "examples": [
        "I can't tell you Maxine's phone number off the top of my head. I'll have to check.",
        "I don't know for sure, but off the top of my head I'd say that renting a two-bedroom apartment would cost about a thousand dollars a week."
      ]
    },
    {
      "idiom": "on the one hand | on the other hand",
      "meaning": "You can say \"on the one hand\" before describing one of two contrasting ideas, options, or opinions, and then say \"on the other hand\" before describing the other one.",
      "examples": [
        "On the one hand smokers should have the right to smoke if they want to, but on the other hand non-smokers should have the right to breathe smoke-free air.",
        "On the one hand I love the freedom of being single, but on the other hand the idea of being married and having a family is very attractive."
      ]
    },
    {
      "idiom": "on your last legs | on its last legs",
      "meaning": "If you say you're on your last legs, it can mean you're close to exhaustion, or it can mean you're close to death. If a thing is on its last legs, it's close to breaking or wearing out.",
      "examples": [
        "Bobby looks like he's on his last legs. Do you think he can make it to the top of the mountain?",
        "My old printer is on its last legs. It's time I got a new one."
      ]
    },
    {
      "idiom": "pay through the nose",
      "meaning": "If you pay through the nose for something, you pay more than the usual price for it.",
      "examples": [
        "I know I pay through the nose for my dental work, but the dentist I see is supposed to be the best, so I don't mind paying more than usual.",
        "We had to pay through the nose for our room because it was a long weekend and most of the hotels were fully booked."
      ]
    },
    {
      "idiom": "pick somebody's brains",
      "meaning": "If you pick somebody's brains, you ask them for detailed information or ideas about something.",
      "examples": [
        "The new guy Gavin was working for our main competitor before coming here, so the boss has been picking his brains to find out what they're doing over there.",
        "Would you mind having a look at our website? I'd love to pick your brains and get some new ideas for it."
      ]
    },
    {
      "idiom": "play it by ear",
      "meaning": "If you play it by ear, you don't plan ahead but you do whatever seems best at the time depending on the situation.",
      "examples": [
        "I like those comedy shows where they play it by ear and just say whatever they like and do whatever they like.",
        "Jean says he's not sure what goes on in the meetings, so he'll just play it by ear and see what happens."
      ]
    },
    {
      "idiom": "pull someone's leg",
      "meaning": "If you pull someone's leg, you play a joke on them by saying something that isn't true.",
      "examples": [
        "I was just pulling Karl's leg when I said Marissa wanted to go out with him, but he believed me and he called her. And now they really are going out!",
        "Joe was just pulling your leg when he said he was going spaghetti picking. Spaghetti doesn't really grow on trees, Sally."
      ]
    },
    {
      "idiom": "put someone's nose out of joint",
      "meaning": "If you put someone's nose out of joint, you upset them by not treating them with as much respect or consideration as they think they deserve.",
      "examples": [
        "Brad had his nose put out of joint when he saw that he didn't get top billing on the movie poster. George's name was written above Brad's name.",
        "Our little boy had his nose put out of joint when we got a bicycle for his sister, so we got him one as well."
      ]
    },
    {
      "idiom": "put your foot in it",
      "meaning": "If you put your foot in it you say or do the wrong thing and usually make matters worse.",
      "examples": [
        "I really put my foot in it when I asked her how her husband was. I forgot that he died last year.",
        "Every time she opens her mouth she puts her foot in it."
      ]
    },
    {
      "idiom": "put your foot in your mouth",
      "meaning": "If you put your foot in your mouth you say or do the wrong thing and usually make matters worse.",
      "examples": [
        "I really put my foot in my mouth when I asked her how her husband was. I forgot that he died last year.",
        "Every time he speaks he puts his foot in his mouth."
      ]
    },
    {
      "idiom": "rack your brains | rack you brain",
      "meaning": "If you rack your brains, or rack you brain, you try hard to remember something or think of a solution to a problem or a puzzle.",
      "examples": [
        "I'm racking my brains, but I just can't think of his name.",
        "Shelley's writing this song about being out of work and she's racking her brain trying to come up with a good rhyme for \"unemployed\"."
      ]
    },
    {
      "idiom": "see eye to eye",
      "meaning": "If you see eye to eye with someone, you totally agree with them about something.",
      "examples": [
        "They don't agree about everything, but when it comes to the most important issues they see eye to eye.",
        "It's funny how they've become friends even though they don't seem to see eye to eye on anything."
      ]
    },
    {
      "idiom": "shoot yourself in the foot",
      "meaning": "If you shoot yourself in the foot, you harm yourself in some way by doing something stupid or making a silly mistake.",
      "examples": [
        "Why does Kerry always shoot herself in the foot by saying the wrong thing?",
        "The Minister of Agriculture shot himself in the foot by saying that farmers couldn't understand economics because they weren't educated. He resigned soon after."
      ]
    },
    {
      "idiom": "stick out like a sore thumb | stand out like a sore thumb",
      "meaning": "If someone sticks out like a sore thumb, or stands out like a sore thumb, everyone notices them because they're not the same as the people around them.",
      "examples": [
        "Kenny stuck out like a sore thumb at the party. He was the only person wearing a suit and a tie.",
        "When I was in the Nigerian countryside I stood out like a sore thumb. I was the only white person around."
      ]
    },
    {
      "idiom": "teething problems | teething troubles",
      "meaning": "If someone or something is having teething problems, or teething troubles, they're having problems during the early stages of something.",
      "examples": [
        "The government had a few teething problems early in its term, but most people think they did a good job overall.",
        "We're still having a few teething troubles, but when everyone adjusts to their roles, everything should be fine."
      ]
    },
    {
      "idiom": "the gift of the gab | the gift of gab",
      "meaning": "If you've got the gift of the gab, or the gift of gab, you have the natural ability to talk in a way that people find entertaining or persuasive.",
      "examples": [
        "All good salespeople have the gift of the gab, so people trust them and believe whatever they say.",
        "If you want to be a politician, you'll do much better if you were born with the gift of gab."
      ]
    },
    {
      "idiom": "the upper hand",
      "meaning": "If you have the upper hand, you have the advantage or you're in the stronger position in a contest or a conflict.",
      "examples": [
        "With one race to go, the Ferrari team has the upper hand. If they get one of the top three places in the last race, they'll win this year's title.",
        "For many years Yahoo was the top search engine, but for the last few years Google has had the upper hand."
      ]
    },
    {
      "idiom": "up in arms",
      "meaning": "If you are up in arms, you are angry about something that you think is unfair or wrong.",
      "examples": [
        "The taxi drivers are up in arms about the new tax on LPG.",
        "Many people expected smokers to be up in arms over the smoking ban, but most of them seem to have accepted it."
      ]
    },
    {
      "idiom": "up to your neck | up to your eyeballs",
      "meaning": "If you're up to your neck in something, or up to your eyeballs in something, you've got too much of it and it's become a problem.",
      "examples": [
        "I'm up to my neck in emails and I don't think I can get away at the moment.",
        "Christmas is the worst time at the animal shelter. We're always up to our eyeballs in stray dogs and cats."
      ]
    },
    {
      "idiom": "vent your spleen",
      "meaning": "If you vent your spleen, you express your anger.",
      "examples": [
        "The company's shareholders were angry, and they used the annual general meeting as an opportunity to vent their spleen on the board members.",
        "Amy felt she had been badly treated by the media, so she took the chance to vent her spleen during the interview."
      ]
    },
    {
      "idiom": "vote with your feet",
      "meaning": "If you vote with your feet, you show your opinion of something by acting in a certain way, such as by buying something if you like it, or by not buying it if you don't like it.",
      "examples": [
        "When the price of concert tickets nearly doubled, music fans voted with their feet and didn't go to the concerts.",
        "Opponents of the fur trade are trying to get people to vote with their feet by refusing to buy from shops that sell any clothes that use fur."
      ]
    },
    {
      "idiom": "warts and all",
      "meaning": "If you show something warts and all, you show it exactly as it is without trying to hide any of its faults or weaknesses.",
      "examples": [
        "Are you sure you want to read the first draft? You'll see it warts and all, with all the mistakes and all the bad writing still there.",
        "People don't want to see an idealised version of his life. They want to know the real story, warts and all."
      ]
    },
    {
      "idiom": "wash your hands of something",
      "meaning": "If you wash your hands of something that you were involved in, you decide to stop being involved in it after losing your interest or belief in it.",
      "examples": [
        "She washed her hands of the whole project after she found out that people had been stealing donated money.",
        "Jim washed his hands of politics long ago after  realising how corrupt most politicians were."
      ]
    },
    {
      "idiom": "weak at the knees",
      "meaning": "If you go weak at the knees, you feel an emotion so strongly that it makes you feel unstable on your feet.",
      "examples": [
        "When he looked at me and smiled, I felt weak at the knees. He was the most beautiful man I'd ever seen!",
        "Just thinking about getting up in front of a thousand people makes me weak at the knees. It's terrifying!"
      ]
    },
    {
      "idiom": "wear your heart on your sleeve",
      "meaning": "If you wear your heart on your sleeve, you show your emotions openly and you don't try to hide your feelings.",
      "examples": [
        "Ivan is one of those tennis players that spectators love to watch because they always wear their heart on their sleeve.",
        "You'll never be a good card player if you wear your heart on your sleeve. Other players can tell if your cards are good or not by watching your reactions when you get them."
      ]
    },
    {
      "idiom": "wet behind the ears",
      "meaning": "If someone is wet behind the ears, they don't have much experience of life.",
      "examples": [
        "He's just finished high school, so he's still wet behind the ears.",
        "Joni's still wet behind the ears and doesn't know how to deal with the other girls who tease her, but she'll soon learn."
      ]
    },
    {
      "idiom": "work your socks off | work your tail off",
      "meaning": "If you work your socks off, or work your tail off, you work very hard.",
      "examples": [
        "We had to get the job finished by Friday, so we worked our socks off to get it done on time.",
        "The sales team worked their tails off this quarter, and they've managed to beat the record for first-quarter sales figures."
      ]
    },
    {
      "idiom": "yellow-bellied",
      "meaning": "If someone is yellow-bellied, they are not brave, or they are cowardly.",
      "examples": [
        "Tony's father called him yellow-bellied when he was a five-year-old boy because he didn't want to ride a horse. Tony has never forgotten it.",
        "The whole country behaved like yellow-bellied cowards when they let a small group of cheats steal the national election."
      ]
    },
    {
      "idiom": "young at heart",
      "meaning": "Someone is young at heart if they still feel young even though they're getting old.",
      "examples": [
        "Terry's nearly seventy but he's still young at heart. He's always trying new things and going to new places.",
        "No matter how old I get, I'll always be young at heart."
      ]
    },
    {
      "idiom": "young blood",
      "meaning": "If you say \"young blood\", you mean young people who have fresh, new ideas and lots of energy.",
      "examples": [
        "The company is successful because they're always bringing in young blood, and this helps them keep up with the latest fashions and ideas.",
        "The trouble with the seniority system is that it keeps young blood out of decision-making positions."
      ]
    }
  ],
  "Buildings": [
    {
      "idiom": "an ivory tower",
      "meaning": "You can say someone's in an ivory tower if they're in a place that separates them from everyday life, such as a university.",
      "examples": [
        "People often complain that academics stuck in their ivory towers don't really understand the problems of the average person.",
        "Peter's dream is to get tenure in a university and spend the rest of his life hidden away in an ivory tower."
      ]
    },
    {
      "idiom": "chickens come home to roost",
      "meaning": "If chickens are coming home to roost, someone is suffering the unpleasant consequences of their bad actions in the past.",
      "examples": [
        "Fred's in hospital with liver problems. I guess the chickens have come home to roost after all those years of heavy drinking.",
        "The chickens are coming home to roost for the executives who committed fraud in the nineties. They're being charged now even though they committed their crimes over ten years ago."
      ]
    },
    {
      "idiom": "hit the roof",
      "meaning": "You can say someone hits the roof if they lose their temper and show their anger.",
      "examples": [
        "When the boss saw Jim's mistake, he hit the roof. He yelled and thumped the desk and told Jim to get out.",
        "When Johnny's dad found out that he'd been smoking cigarettes, he hit the roof."
      ]
    },
    {
      "idiom": "hold the fort",
      "meaning": "If you hold the fort, you look after a place or a business while the person who is normally in charge is away.",
      "examples": [
        "Can you hold the fort while I run down to the bank?",
        "Your job will be to serve customers, and occasionally hold the fort if I have to go out."
      ]
    },
    {
      "idiom": "make yourself at home",
      "meaning": "If you make yourself at home, you relax and feel comfortable in someone else's home.",
      "examples": [
        "When we arrived at my apartment, I showed my guests the sofa and said, \"Make yourself at home.\"",
        "Bill certainly knows how to make himself at home. Within five minutes of arriving he'd turned on my TV and helped himself to a beer from my fridge."
      ]
    },
    {
      "idiom": "nothing to write home about",
      "meaning": "If you say something is nothing to write home about, you mean it isn't very important or it isn't very good.",
      "examples": [
        "We saw a movie today and it was nothing to write home about. It was just a typical action movie.",
        "Helen said her date with the guy she met online was nothing to write home about, and she probably wouldn't see him again."
      ]
    },
    {
      "idiom": "put your own house in order | get your own house in order",
      "meaning": "If you say to someone \"put your own house in order\", or \"get your own house in order\", you think they should solve their own problems before telling someone else how to solve theirs.",
      "examples": [
        "You should put your own house in order before telling other people what to do.",
        "Ian has plenty of problems of his own, so he needs to get his own house in order before he starts telling other people how to live their lives."
      ]
    },
    {
      "idiom": "run-of-the-mill",
      "meaning": "Something is run-of-the-mill if it is ordinary and nothing special.",
      "examples": [
        "There wasn't much on TV so we just watched some run-of-the-mill old cowboy movie.",
        "I don't know why he won the competition. He wasn't terrible, but he wasn't anything special either; just a run-of-the-mill singer as far as I could see."
      ]
    },
    {
      "idiom": "the writing | handwriting is on the wall",
      "meaning": "If the writing is on the wall, or the handwriting is on the wall, there are signs that a person or organization is in trouble and might soon fail.",
      "examples": [
        "The writing has been on the wall for this government ever since the street protests and demonstrations against it first began.",
        "Their old quarterback was occasionally dropped from the team early in the season, so the handwriting was on the wall even then."
      ]
    },
    {
      "idiom": "waiting in the wings",
      "meaning": "If you're waiting in the wings, you're ready to take over a role or a position when you have the chance to do so.",
      "examples": [
        "In politics, there are always plenty of people waiting in the wings ready for a chance to take power.",
        "Everybody knows that the chairman's son is waiting in the wings and will take over as soon as his father retires."
      ]
    }
  ],
  "Clothing": [
    {
      "idiom": "a knight in shining armour | armor",
      "meaning": "If someone is a knight in shining armour, they help you when you are in a difficult situation.",
      "examples": [
        "Jason was my knight in shining armour. He brought food and newspapers every day until I got better.",
        "People thought the new president was a knight in shining armour, but they soon found out he was just another politician."
      ]
    },
    {
      "idiom": "a wolf in sheep's clothing",
      "meaning": "A wolf in sheep's clothing is someone who seems to be a good person but is really a bad person.",
      "examples": [
        "The priest at our church seemed to be a very warm and caring man, but we later found out that he was a wolf in sheep's clothing.",
        "People in our town suspected that Henry was a wolf in sheep's clothing, but I think they were wrong."
      ]
    },
    {
      "idiom": "at the drop of a hat",
      "meaning": "If you do something at the drop of a hat, you do it immediately, without preparation or planning.",
      "examples": [
        "I'd quit my job at the drop of a hat if I didn't have a family to support.",
        "Lee: You can't just go running off to some beach resort at the drop of a hat whenever you feel like  it. Kim: Why not?"
      ]
    },
    {
      "idiom": "deep pockets",
      "meaning": "You can say a person or an organisation has deep pockets if they have lots of money.",
      "examples": [
        "Let's make a list of everyone we know with deep pockets, and see if any of them want to invest in our company.",
        "People think the government has very deep pockets, but in fact it's broke and it's borrowing from banks and other countries."
      ]
    },
    {
      "idiom": "dressed (up) to the nines",
      "meaning": "If you are dressed to the nines, or dressed up to the nines, you are wearing very smart clothes for a special occasion.",
      "examples": [
        "Have you seen Harry? He's dressed to the nines and he looks amazing.",
        "Everyone was dressed up to the nines for the Academy Awards, with the men in tuxedos and the women in evening gowns."
      ]
    },
    {
      "idiom": "earn your stripes",
      "meaning": "If you earn your stripes, you do something to prove that you have the skills or ability for a particular job or rank.",
      "examples": [
        "He earned his stripes in the department of foreign affairs before becoming one of our ambassadors.",
        "You'll need to earn your stripes as a travelling salesman before we can think about giving you more responsibility."
      ]
    },
    {
      "idiom": "fill somebody's shoes",
      "meaning": "If you can fill somebody's shoes, you can replace them and do what they do.",
      "examples": [
        "Greg was a great captain for the team so it'll be difficult to find someone who can fill his shoes now that he's retiring.",
        "The general manager is training his son to fill his shoes when he passes the business on to him."
      ]
    },
    {
      "idiom": "hot under the collar",
      "meaning": "If you are hot under the collar, you feel angry or annoyed about something.",
      "examples": [
        "The coach was getting hot under the collar because he thought the referee was making unfair decisions against his players.",
        "We could see Matt was getting hot under the collar because of what Ken was saying, so we changed the subject."
      ]
    },
    {
      "idiom": "keep it under your hat",
      "meaning": "If someone tells you a secret and you keep it under your hat, you don't tell anyone.",
      "examples": [
        "I'll only tell you if you promise to keep it under your hat.",
        "Aunt Biddy said she couldn't possibly tell me the family secrets because she'd pledged on her mother's grave to keep them under her hat."
      ]
    },
    {
      "idiom": "knock your socks off",
      "meaning": "If something knocks your socks off, it amazes you and surprises you.",
      "examples": [
        "When Nora did her presentation on the new development, she knocked our socks off. It was very impressive.",
        "Michael knocked everyone's socks off when he performed at the music awards. It was the best performance of the night, by far."
      ]
    },
    {
      "idiom": "off the cuff",
      "meaning": "If you speak off the cuff, you speak without planning what you will say beforehand.",
      "examples": [
        "She wasn't expecting to win, so she hadn't prepared a speech, but she still managed to say a few words off the cuff after being given the award.",
        "The prime minister keeps making off-the-cuff remarks that get him into trouble."
      ]
    },
    {
      "idiom": "old hat",
      "meaning": "If something is old hat, it's old-fashioned and no longer seen as being modern and new.",
      "examples": [
        "When I was a teenager in the 1980's punk and new-wave music was all the rage, but now it seems a bit old hat.",
        "Lots of technology that seems new and modern here is already old hat in places like Japan and South Korea."
      ]
    },
    {
      "idiom": "pull your socks up",
      "meaning": "You can say \"pull your socks up\" to someone if you think they should improve the way they are behaving or the way they are doing something.",
      "examples": [
        "He'll lose his job unless he pulls his socks up and starts doing a lot better.",
        "The coach said I have to pull my socks up or I'll lose my spot on the team."
      ]
    },
    {
      "idiom": "quaking in your boots",
      "meaning": "If you're quaking in your boots, you are very frightened.",
      "examples": [
        "This big, ugly dog was growling at me and baring its teeth. I was quaking in my boots, I can tell you!",
        "Our sergeant was a scary guy. He could make a new army recruit quake in his boots just by looking at him."
      ]
    },
    {
      "idiom": "rags to riches",
      "meaning": "If you go from rags to riches, you start out very poor and you become very rich.",
      "examples": [
        "My grandfather went from rags to riches when his dishwashing liquid became very popular. He started out making it at home, but in less than a year he had his own factory.",
        "Most of these young guys in professional basketball came from poor neighbourhoods and they all have the same rags-to-riches story."
      ]
    },
    {
      "idiom": "talk through your hat",
      "meaning": "If you're talking through your hat, you're talking about something without knowing much about it, or you claim something is true when it isn't.",
      "examples": [
        "Evan says that quantum physics proves that space and time don't really exist, but Kathy says he's talking through his hat.",
        "I proved that George was talking through his hat by checking on the internet to find out if what he said is true - and it isn't."
      ]
    },
    {
      "idiom": "the jewel in the crown",
      "meaning": "If something is the jewel in the crown, it's part of a group or set of similar things, and it's the best of them all.",
      "examples": [
        "Sydney's Opera House is the jewel in the crown of modern Australian architecture.",
        "Dudley has many companies, but he regards his cable TV channel \"World of the Arts\" as the jewel in the crown of his business empire."
      ]
    },
    {
      "idiom": "tighten your belt",
      "meaning": "If you tighten your belt, you try to spend less money.",
      "examples": [
        "I'll have to tighten my belt for a while so I can pay off my debts.",
        "Pablo says his family have had to tighten their belts because everything costs much more now."
      ]
    },
    {
      "idiom": "wear your heart on your sleeve",
      "meaning": "If you wear your heart on your sleeve, you show your emotions openly and you don't try to hide your feelings.",
      "examples": [
        "Ivan is one of those tennis players that spectators love to watch because they always wear their heart on their sleeve.",
        "You'll never be a good card player if you wear your heart on your sleeve. Other players can tell if your cards are good or not by watching your reactions when you get them."
      ]
    },
    {
      "idiom": "work your socks off | work your tail off",
      "meaning": "If you work your socks off, or work your tail off, you work very hard.",
      "examples": [
        "We had to get the job finished by Friday, so we worked our socks off to get it done on time.",
        "The sales team worked their tails off this quarter, and they've managed to beat the record for first-quarter sales figures."
      ]
    }
  ],
  "Colours": [
    {
      "idiom": "a red-letter day",
      "meaning": "A red-letter day is a day that is very important for some reason.",
      "examples": [
        "The day Tatiana graduated from university was a red-letter day for her whole family. She was the first person in the family's history to get a university degree.",
        "Today is a fantastic day for us - a real red-letter day! We've just been blessed with our first child - a beautiful baby boy!"
      ]
    },
    {
      "idiom": "a white lie",
      "meaning": "If you tell a white lie, you say something that isn't true in order to be polite or so as not to hurt someone's feelings.",
      "examples": [
        "Sometimes it's better to tell a white lie than to tell someone a painful truth.",
        "I really didn't want to go to my boss's dinner party, so I told a white lie and said I had to go to a friend's wedding party that night."
      ]
    },
    {
      "idiom": "caught red-handed",
      "meaning": "If someone is caught red-handed, they are caught in the act of doing something wrong such as cheating or stealing.",
      "examples": [
        "I used to cheat in exams until I was caught red-handed by my teacher. I stopped doing it after that.",
        "How can you say you didn't steal the book? You were caught red-handed walking out of the store after you'd hidden it under your jacket."
      ]
    },
    {
      "idiom": "give the green light",
      "meaning": "If you give something the green light, you give permission for it to be done, or allow it to happen.",
      "examples": [
        "The government has given the green light to our tree-planting project, so we can go ahead and start organizing things.",
        "As soon as our CEO gives the new product the green light, we'll start planning production."
      ]
    },
    {
      "idiom": "in the black",
      "meaning": "If a person or a company is in the black, their assets are greater than their debts.",
      "examples": [
        "It's taken a long time, but we've paid off our loans and we're in the black again at last.",
        "If you rearrange your debts and save more than you spend, you could be in the black again within three years."
      ]
    },
    {
      "idiom": "in the dark",
      "meaning": "If you're in the dark about something, you don't know about it.",
      "examples": [
        "The company is going to cut some jobs, but they're keeping the workers in the dark so they won't cause trouble.",
        "We were completely in the dark about Mark and Jenny and we still can't believe they're getting married next month."
      ]
    },
    {
      "idiom": "in the red",
      "meaning": "If a person or a company is in the red, their debts are greater than their assets.",
      "examples": [
        "Even if we make a profit this year, we owe so much money that we'll probably still be in the red.",
        "I don't like being in the red, so I don't borrow money."
      ]
    },
    {
      "idiom": "kill the goose that lays the golden egg",
      "meaning": "If you kill the goose that lays the golden egg, you destroy something that has made you a lot of money.",
      "examples": [
        "The thing that attracted tourists to the island was the peace and quiet. But greedy developers have killed the goose that laid the golden egg by opening noisy nightclubs, so no-one goes there now.",
        "Parents and agents of successful child actors and singers often kill the goose that laid the golden egg by making the kids work too much, and the kids lose the magic spark that made them special in the first place."
      ]
    },
    {
      "idiom": "once in a blue moon",
      "meaning": "If something happens once in a blue moon, it happens very rarely.",
      "examples": [
        "We hardly ever go out these days, though once in a blue moon we might go and see a movie.",
        "My daughter lives in Brazil and she only comes to see us once in a blue moon; maybe every two or three years if we're lucky."
      ]
    },
    {
      "idiom": "out of the blue",
      "meaning": "If something happens out of the blue, you're not expecting it to happen and you're surprised when it does.",
      "examples": [
        "A letter came today, totally out of the blue, from a lawyer who said that an uncle I hadn't heard from in years had died and left me a million dollars. But then my alarm went off ... and I woke up.",
        "A girl Barry had known years ago called him out of the blue and invited him to her wedding. He was very surprised, as you can imagine."
      ]
    },
    {
      "idiom": "paint the town red",
      "meaning": "If you paint the town red, you visit bars, nightclubs and other nightspots to have a good time.",
      "examples": [
        "It's Ian's birthday so he's going out with some friends tonight to paint the town red.",
        "Going out and painting the town red is great fun, but you can't do it every night."
      ]
    },
    {
      "idiom": "red light district",
      "meaning": "A red light district is the area of a town or city in which prostitutes work.",
      "examples": [
        "Mark told us about the red light district in Amsterdam, and how the women there sit behind windows waiting for customers.",
        "Towns and cities all over the world have always had red light districts."
      ]
    },
    {
      "idiom": "red tape",
      "meaning": "Strict adherence to rules and regulations so that a procedure seems to take longer than necessary.",
      "examples": [
        "It takes a long time to set up a company in some countries because of all the red tape involved in getting government permits.",
        "It took two weeks to get visas for our aid workers because of all the red tape."
      ]
    },
    {
      "idiom": "see red",
      "meaning": "If you see red, you become extremely angry.",
      "examples": [
        "We were playing baseball when one of the batters saw red after a pitcher threw the ball straight at his head. He ran up to the guy and punched him.",
        "There's no point getting into a fight, so if you see red just count to ten and wait for the anger to die down."
      ]
    },
    {
      "idiom": "see through rose-coloured glasses | rose-colored glasses",
      "meaning": "If someone sees things through rose-coloured glasses, they see things as being better than they really are.",
      "examples": [
        "Tina sees things through rose-coloured glasses, so when things aren't going very well, she won't do anything to improve the situation.",
        "If you have the courage and maturity to see things as they really are, you'll no longer need to see things through rose-colored glasses."
      ]
    },
    {
      "idiom": "show your true colours | show your true colors",
      "meaning": "You show your true colours if you show what you're really like, or you reveal your true character.",
      "examples": [
        "Bob always acts like he's a strong, brave guy, but when the hurricane hit he showed his true colors. He was too scared to go check on old Mrs Flowers, our next-door neighbour.",
        "The players showed their true colours when they came back from three goals down to win the match."
      ]
    },
    {
      "idiom": "with flying colours | colors",
      "meaning": "If you pass a test with flying colours, you pass it easily and get high marks.",
      "examples": [
        "Our daughter Rosie was really worried about her history exam, but in the end she passed it with flying colours. We're very proud of her.",
        "I was given a tough assignment at work this week, and today the boss told me it was really just a test. He also said I passed with flying colors."
      ]
    },
    {
      "idiom": "yellow journalism",
      "meaning": "Journalism in which sensational stories are used to boost sales, or biased reporting is used to change the reader's views on an issue. Both of these are unethical.",
      "examples": [
        "Have you noticed how, during a war, normally trustworthy professionals start writing the worst sort of yellow journalism to justify their government's actions?",
        "Joe: \"Is there any difference between yellow journalism and propaganda?\" Kate: \"I think yellow journalism can be even more dangerous than propaganda if it's  being presented as objective reporting by well-known journalists.\""
      ]
    },
    {
      "idiom": "yellow streak",
      "meaning": "If someone has a yellow streak, they can sometimes act in a cowardly way and not be very brave.",
      "examples": [
        "Some people say Jimmy's got a yellow streak a mile wide, but I've never seen anything in him except courage and bravery.",
        "Monty says he likes his yellow streak because it keeps him out of trouble. He never gets into fights or has accidents because he's so scared of getting hurt."
      ]
    },
    {
      "idiom": "yellow-bellied",
      "meaning": "If someone is yellow-bellied, they are not brave, or they are cowardly.",
      "examples": [
        "Tony's father called him yellow-bellied when he was a five-year-old boy because he didn't want to ride a horse. Tony has never forgotten it.",
        "The whole country behaved like yellow-bellied cowards when they let a small group of cheats steal the national election."
      ]
    }
  ],
  "Death": [
    {
      "idiom": "a matter of life and death",
      "meaning": "If something is a matter of life and death, it's extremely important and it could involve someone's survival.",
      "examples": [
        "Education about HIV and AIDS is a matter of life and death. If people aren't told to protect themselves with condoms, they could die from the disease.",
        "Getting someone to hospital quickly after an accident or a heart attack is a matter of life and death. Just a few minutes can make all the difference."
      ]
    },
    {
      "idiom": "dead in the water",
      "meaning": "If something is dead in the water, it has no chance of succeeding or of making any progress.",
      "examples": [
        "I'm sure that George's new company is dead in the water. Nobody's interested in buying his product.",
        "The government's new health bill is dead in the water. It's got no chance of getting through the Senate."
      ]
    },
    {
      "idiom": "dead to the world",
      "meaning": "If you're dead to the world, you are sound asleep.",
      "examples": [
        "It looks like Kerry's spending the night on our sofa. She had two beers and now she's dead to the world.",
        "Our boss must have had a late night. He's in his office with his face on the desk, dead to the world."
      ]
    },
    {
      "idiom": "dig one's own grave",
      "meaning": "If you dig your own grave, you do something unwise that will result in your own failure or downfall in the future.",
      "examples": [
        "Anyone who eats too much and doesn't exercise is digging their own grave.",
        "Jim lost his job, but he dug his own grave by being late all the time."
      ]
    },
    {
      "idiom": "kick the bucket",
      "meaning": "If someone kicks the bucket, they die.",
      "examples": [
        "When I kick the bucket, you can just bury me under a tree at the bottom of the garden.",
        "Did you see the movie \"Bucket List\"? It's about these two old guys who make a list of all the things they want to do before they kick the bucket."
      ]
    },
    {
      "idiom": "kill the goose that lays the golden egg",
      "meaning": "If you kill the goose that lays the golden egg, you destroy something that has made you a lot of money.",
      "examples": [
        "The thing that attracted tourists to the island was the peace and quiet. But greedy developers have killed the goose that laid the golden egg by opening noisy nightclubs, so no-one goes there now.",
        "Parents and agents of successful child actors and singers often kill the goose that laid the golden egg by making the kids work too much, and the kids lose the magic spark that made them special in the first place."
      ]
    },
    {
      "idiom": "kill time",
      "meaning": "You kill time when you do something to amuse yourself while waiting for something.",
      "examples": [
        "I had to kill time at the airport because of the delay so I bought a book of crossword puzzles.",
        "We kill time on long trips by playing this game in which someone thinks of a country, and the next person has to think of another country that starts with the last letter of the first one, like Thailand, Denmark, Kenya, Afghanistan, Nepal, and so on."
      ]
    },
    {
      "idiom": "kill two birds with one stone",
      "meaning": "If you kill two birds with one stone, you achieve two things with the one action.",
      "examples": [
        "I need to go to the bank, and if I drop the books off at the library on the way I'll be killing two birds with one stone.",
        "Jenny says that she kills two birds with one stone if she does her own housework because she gets the house clean and she gets some exercise at the same time."
      ]
    },
    {
      "idiom": "make a killing",
      "meaning": "If you make a killing, you make a lot of money from a sale or a deal of some sort.",
      "examples": [
        "My aunt made a killing when she bought some shares in a company as soon as they were issued, and sold them a few weeks later for three times what she paid.",
        "Lots of people made a killing when property values went so high back in the nineties."
      ]
    },
    {
      "idiom": "Never say die!",
      "meaning": "You can say \"Never say die!\" if you want to tell someone to keep trying while there's still a chance of success.",
      "examples": [
        "We were two goals down with only a few minutes to go, but our captain wouldn't give up. He was shouting, \"Come on, guys! Never say die!\"",
        "After falling off his surfboard for the hundredth time, Craig climbed back on and said with a laugh, \"Never say die!\""
      ]
    }
  ],
  "Food": [
    {
      "idiom": "(have) egg on your face",
      "meaning": "You will have egg on your face if you've said or done something wrong, and it's made you feel embarrassed or stupid.",
      "examples": [
        "Stan had egg on his face after saying he could easily do fifty push-ups, and then giving up after  doing just twenty.",
        "The police force had egg on its face because they arrested and beat up an innocent guy who had the same name as a suspect they were looking for."
      ]
    },
    {
      "idiom": "(your) bread and butter",
      "meaning": "Your bread and butter is your livelihood or the source of your income.",
      "examples": [
        "Bartending is my bread and butter at the moment, but I'm trying to get into acting.",
        "The conditions are bad, but this work is their bread and butter so make sure the workers have other jobs before you close down the factory."
      ]
    },
    {
      "idiom": "a couch potato",
      "meaning": "You can say someone's a couch potato if they're very lazy and they spend a lot of time sitting around watching TV and eating junk food.",
      "examples": [
        "Since he lost his job, Marty has become a couch potato.",
        "How can you expect to feel good and look good if you're a couch potato? If you turn off the TV, get some exercise, and eat healthy food, you'll soon look good and feel great."
      ]
    },
    {
      "idiom": "a flash in the pan",
      "meaning": "You can say something or someone is a flash in the pan if they're popular or effective for a short time only.",
      "examples": [
        "Her first song was a big hit, but when Debbie's next song didn't do so well people started calling her a flash in the pan.",
        "Dave says he doesn't mind being called a flash in the pan because he still gets money for the book he wrote, even though he never wrote another one."
      ]
    },
    {
      "idiom": "a knuckle sandwich",
      "meaning": "If you give someone a knuckle sandwich, you punch them.",
      "examples": [
        "If you say that again you'll get a knuckle sandwich!",
        "Simon said he'd give me a knuckle sandwich if I wasn't careful, so I said \"Come on then, let's go outside!\""
      ]
    },
    {
      "idiom": "a piece of cake",
      "meaning": "If you say that something is a piece of cake, you mean that it is extremely easy.",
      "examples": [
        "I finished my exam 30 minutes early. It was a piece of cake!",
        "Compared to learning Japanese, learning Indonesian was a piece of cake. It's a much simpler language."
      ]
    },
    {
      "idiom": "a recipe for disaster",
      "meaning": "Something is a recipe for disaster if it's going to cause trouble or serious problems.",
      "examples": [
        "Inviting my mother-in-law to stay for a week is a recipe for disaster. I'll end up arguing with her, and then my wife and I will quarrel and then the kids will get upset. It's a bad idea!",
        "Eating too much, not exercising enough, and being under stress is a recipe for disaster. You'll end up overweight and you'll probably die young."
      ]
    },
    {
      "idiom": "chew the fat | chew the rag",
      "meaning": "If you chew the fat, or chew the rag, you have a long, friendly chat with someone.",
      "examples": [
        "I sometimes call Wendy late at night and we chew the fat for an hour or so before going to sleep.",
        "Why don't you come over on Sunday morning and I'll make some breakfast and we can chew the rag for a couple of hours?"
      ]
    },
    {
      "idiom": "drink like a fish",
      "meaning": "If someone drinks like a fish, they drink a lot of alcohol.",
      "examples": [
        "Since he got back from the war Billy's been drinking like a fish, and we think he needs some help.",
        "Some people might say I drink like a fish, but I don't think I drink too much."
      ]
    },
    {
      "idiom": "easy as pie | easy as abc",
      "meaning": "If something's as easy as pie, or easy as abc, it's very easy.",
      "examples": [
        "Setting up the printer was as easy as pie.",
        "You'll have no trouble finding your way around the website. It's easy as abc."
      ]
    },
    {
      "idiom": "eat humble pie",
      "meaning": "If you eat humble pie, you admit that you are in the wrong and behave apologetically.",
      "examples": [
        "Jim had to eat humble pie after we proved that what he'd said was wrong.",
        "Some politicians are so arrogant that they won't eat humble pie even when it's clear they've made a mistake. They just say they were \"misinformed\"."
      ]
    },
    {
      "idiom": "eat your words",
      "meaning": "If you eat your words, you admit that something you said was wrong.",
      "examples": [
        "The president was forced to eat his words after it was shown that what he'd said wasn't true.",
        "Martina said I'd never win a gold medal, but now that I have she'll have to eat her words."
      ]
    },
    {
      "idiom": "go down a treat",
      "meaning": "If something goes down a treat, it's a great success and everyone enjoys it.",
      "examples": [
        "The speech Lenny made at his daughter's wedding went down a treat. Everyone thought it was very funny but also very moving.",
        "Geraldine made some pancakes for breakfast and they went down a treat. They were really delicious."
      ]
    },
    {
      "idiom": "grease someone's palm",
      "meaning": "If you grease someone's palm, you pay them a bribe.",
      "examples": [
        "The only way to get a government contract around here is to grease someone's palm.",
        "If you want to get out of jail, grease the warden's palm and the guards will let you escape."
      ]
    },
    {
      "idiom": "half-baked",
      "meaning": "If something is half-baked, it hasn't been properly thought out or planned.",
      "examples": [
        "The trouble with Mick is that some of his ideas are good, but a lot of them are half-baked and can't be used.",
        "Editing a student newspaper is difficult because I get a lot of half-baked poems and stories from the kids, and they get upset if I don't publish them."
      ]
    },
    {
      "idiom": "hard to swallow",
      "meaning": "Something that someone has said is hard to swallow if it's difficult to believe.",
      "examples": [
        "His excuse for coming late was a bit hard to swallow, don't you think?",
        "I find a lot of Jack's stories hard to swallow, but I still enjoy hearing them even if they aren't entirely true."
      ]
    },
    {
      "idiom": "in a nutshell",
      "meaning": "You can say \"in a nutshell\" if you're about to describe something as briefly as possible, or you're going to sum something up.",
      "examples": [
        "It's a very complex situation, but the problem is, in a nutshell, a lack of sales.",
        "The president's in trouble and the reason, in a nutshell, is that people no longer trust him."
      ]
    },
    {
      "idiom": "junk food",
      "meaning": "Food that is bad for us because it contains large amounts of harmful substances like artificial colouring, preservatives, salt, refined sugar, and so on.",
      "examples": [
        "No wonder people in Western societies are so unhealthy, overweight and unattractive. Have you seen the sort of junk food they're addicted to?",
        "Food companies spend millions developing and advertising junk foods that make us fat, sick and ugly because the profits from this sort of food are far greater than the profits made by selling healthy foods."
      ]
    },
    {
      "idiom": "kill the goose that lays the golden egg",
      "meaning": "If you kill the goose that lays the golden egg, you destroy something that has made you a lot of money.",
      "examples": [
        "The thing that attracted tourists to the island was the peace and quiet. But greedy developers have killed the goose that laid the golden egg by opening noisy nightclubs, so no-one goes there now.",
        "Parents and agents of successful child actors and singers often kill the goose that laid the golden egg by making the kids work too much, and the kids lose the magic spark that made them special in the first place."
      ]
    },
    {
      "idiom": "not your cup of tea",
      "meaning": "If something is not your cup of tea, it's not what you like or what you're interested in.",
      "examples": [
        "Action movies aren't really my cup of tea. I prefer dramas and comedies, to be honest.",
        "Karen knows all that new-age spiritual stuff isn't my cup of tea, so why would she give me a book on star signs and astrology for my birthday?"
      ]
    },
    {
      "idiom": "on the back burner",
      "meaning": "If a plan or a project is on the back burner, it isn't being worked on at present, but it might be completed in the future.",
      "examples": [
        "Plans for the new factory have been put on the back burner until the economy improves.",
        "It's a great idea, but we're too busy to look into it now so we'll put it on the back burner for a while."
      ]
    },
    {
      "idiom": "put all your eggs in the one basket",
      "meaning": "If you put all your eggs in the one basket, you put all your efforts or resources into one person, one thing or one plan, and if things don't work out, you lose everything.",
      "examples": [
        "My stockbroker says I should buy shares in a lot of different companies, and not put all my eggs in the one basket.",
        "Our company should distribute many different products from many different companies. If we put all our eggs in the one basket, we'll get into trouble if there's a problem with that one product or company."
      ]
    },
    {
      "idiom": "take with a grain of salt | take with a pinch of salt",
      "meaning": "If you take what someone says with a grain of salt, or with a pinch of salt, you have doubts about the truth or accuracy of what they say.",
      "examples": [
        "Uncle Bill tells some great stories, but we take what he says with a grain of salt because he sometimes exaggerates or makes things up.",
        "Sue says the internet is great, but she takes a lot of the information there with a pinch of salt until she sees the same information on a few different websites."
      ]
    },
    {
      "idiom": "talk turkey",
      "meaning": "If you talk turkey, you discuss something seriously, usually to do with business or money.",
      "examples": [
        "After the owner had shown him around the apartment, Shane decided it was just what he wanted, so he said, \"OK, I'm interested. Let's talk turkey.\"",
        "I started to say something about the deal, but Mr Hamilton said, \"Not now, my boy. We never talk turkey at the dinner table.\""
      ]
    },
    {
      "idiom": "the cream of the crop",
      "meaning": "If something or someone is in the cream of the crop, they are among the best of a class of things or people.",
      "examples": [
        "The cream of the crop of this year's high-school graduates will get into the best universities, as usual.",
        "We're only interested in the cream of the crop, so don't send us any second-rate samples."
      ]
    },
    {
      "idiom": "the icing on the cake | the frosting on the cake",
      "meaning": "If something is the icing on the cake, or the frosting on the cake, it makes a good situation or a good result even better.",
      "examples": [
        "The fifty thousand dollars the government will give to every athlete who wins a gold medal in the Olympics will be the icing on the cake for them.",
        "I was happy just to get my book published, so winning the young writer's prize as well is the frosting on the cake."
      ]
    },
    {
      "idiom": "the upper crust",
      "meaning": "If you are one of the upper crust, you are a member of society's highest class.",
      "examples": [
        "If Laura was really part of the upper crust, she wouldn't need to borrow money all the time, would she?",
        "Marge does a great imitation of an upper-crust \"society queen\". It's really funny, and her upper-crust accent is perfect."
      ]
    },
    {
      "idiom": "upset the applecart",
      "meaning": "If you upset the applecart, you do something that causes trouble or upsets someone's plans.",
      "examples": [
        "The Stones upset the applecart by pulling out of the music festival. They were going to be the main act.",
        "Kelly's sister really upset the applecart when she told Kelly that she'd seen her husband waiting for someone in a hotel lobby when he was supposed to be in New York."
      ]
    },
    {
      "idiom": "whet your appetite",
      "meaning": "If something whets your appetite, it makes you want something, or it stimulates your desire for something.",
      "examples": [
        "My wife has been listening to reggae music all day. She heard a song by Bob Marley on the radio this morning, and it really whetted her appetite for reggae.",
        "Those ads on TV really whet my appetite for pizza. I even ordered one once, just because of the ad. And I wasn't even hungry!"
      ]
    },
    {
      "idiom": "You are what you eat.",
      "meaning": "You can say \"you are what you eat\" when you want to point out the connection between food and health.",
      "examples": [
        "Why do you eat so much bad stuff like pizza, hamburgers,  fries and ice-cream? You are what you eat, you know.",
        "Shelley looks fantastic. When people ask her what her secret is, she smiles and says, \"It's simple. You are what you eat.\""
      ]
    }
  ],
  "Health": [
    {
      "idiom": "a new lease of life",
      "meaning": "If someone has a new lease of life, they have a new enthusiasm for living.",
      "examples": [
        "After recovering from her illness, Kathy had a new lease of life and made lots of plans for the future.",
        "When my uncle quit drinking it gave him a new lease of life and he started doing things he hadn't done for years."
      ]
    },
    {
      "idiom": "a pain in the neck",
      "meaning": "You can say someone is a pain in the neck if they annoy you, or something is a pain in the neck if you don't like doing it.",
      "examples": [
        "Lenny's being a pain in the neck today. He keeps interrupting me while I'm trying to work.",
        "It's a real pain in the neck when you're trying to get some sleep on the train and people keep shouting into their mobile phones all around you."
      ]
    },
    {
      "idiom": "a shot in the arm",
      "meaning": "You can say something is a shot in the arm if it gives a person or an organisation renewed energy or enthusiasm.",
      "examples": [
        "Getting a grant from the Arts Council was a much-needed shot in the arm for the orchestra.",
        "We all agree that the economy needs a shot in the arm, but we can't agree on exactly what it should be."
      ]
    },
    {
      "idiom": "do you the world of good",
      "meaning": "If something does you the world of good, it makes you feel a lot better.",
      "examples": [
        "That was a wonderful massage. It did me the world of good.",
        "Why don't you go for a walk in the forest. It'll do you the world of good to get away from everything for a while."
      ]
    },
    {
      "idiom": "fresh as a daisy",
      "meaning": "If you feel as fresh as a daisy, you feel energetic and lively.",
      "examples": [
        "I might look awful first thing in the morning, but after a cup of tea and a bit of meditation I'm as fresh as a daisy.",
        "George looked terrible when he got to work, so Annie said, \"Fresh as a daisy this morning, are we?\" and George just grunted."
      ]
    },
    {
      "idiom": "ill at ease",
      "meaning": "If you're ill at ease, you feel tense or you can't relax in a situation.",
      "examples": [
        "Liam always looks ill at ease when he's being interviewed on T.V.",
        "I don't mean to make people feel ill at ease, but I seem to have that effect on some people."
      ]
    },
    {
      "idiom": "junk food",
      "meaning": "Food that is bad for us because it contains large amounts of harmful substances like artificial colouring, preservatives, salt, refined sugar, and so on.",
      "examples": [
        "No wonder people in Western societies are so unhealthy, overweight and unattractive. Have you seen the sort of junk food they're addicted to?",
        "Food companies spend millions developing and advertising junk foods that make us fat, sick and ugly because the profits from this sort of food are far greater than the profits made by selling healthy foods."
      ]
    },
    {
      "idiom": "just what the doctor ordered",
      "meaning": "You can say something was just what the doctor ordered when it was exactly what was needed.",
      "examples": [
        "That was a great meal, Ken. Just what the doctor ordered!",
        "Kathie said she had a great time at the beach. After all those problems at work it was just what the doctor ordered."
      ]
    },
    {
      "idiom": "kick the habit",
      "meaning": "If you kick the habit, you manage to stop doing something that has become a bad habit.",
      "examples": [
        "I wish I could stop smoking cigarettes but I just can't kick the habit.",
        "Rashid used to bite his fingernails but his girlfriend made him kick the habit."
      ]
    },
    {
      "idiom": "on your last legs | on its last legs",
      "meaning": "If you say you're on your last legs, it can mean you're close to exhaustion, or it can mean you're close to death. If a thing is on its last legs, it's close to breaking or wearing out.",
      "examples": [
        "Bobby looks like he's on his last legs. Do you think he can make it to the top of the mountain?",
        "My old printer is on its last legs. It's time I got a new one."
      ]
    },
    {
      "idiom": "recharge your batteries",
      "meaning": "You recharge your batteries if you do something to regain your energy after a period of hard work.",
      "examples": [
        "Vicky was really tired after organizing last month's seminar, so she's gone to one of those spa-resorts for a few days to recharge her batteries.",
        "What do you do when you need to recharge your batteries?"
      ]
    },
    {
      "idiom": "sick as a dog",
      "meaning": "If you're as sick as a dog, you're very sick.",
      "examples": [
        "I've been as sick as a dog since I ate those sausage rolls.",
        "Helen hates to miss work, so she really must be sick as a dog if she isn't here."
      ]
    },
    {
      "idiom": "stick out like a sore thumb | stand out like a sore thumb",
      "meaning": "If someone sticks out like a sore thumb, or stands out like a sore thumb, everyone notices them because they're not the same as the people around them.",
      "examples": [
        "Kenny stuck out like a sore thumb at the party. He was the only person wearing a suit and a tie.",
        "When I was in the Nigerian countryside I stood out like a sore thumb. I was the only white person around."
      ]
    },
    {
      "idiom": "teething problems | teething troubles",
      "meaning": "If someone or something is having teething problems, or teething troubles, they're having problems during the early stages of something.",
      "examples": [
        "The government had a few teething problems early in its term, but most people think they did a good job overall.",
        "We're still having a few teething troubles, but when everyone adjusts to their roles, everything should be fine."
      ]
    },
    {
      "idiom": "under the weather",
      "meaning": "If you are under the weather, you're not feeling well.",
      "examples": [
        "Hiroko's feeling a bit under the weather. He thinks he might have the flu.",
        "Sorry, but I don't think I'll be able to make it to work today. I'm feeling a bit under the weather."
      ]
    },
    {
      "idiom": "verbal diarrhoea",
      "meaning": "If someone has verbal diarrhoea, they can't stop talking.",
      "examples": [
        "Janice has a real bad case of verbal diarrhoea. It's like she's afraid of silence and has to keep talking to block it out.",
        "I don't know if you could say he's got verbal diarrhoea, but Alan sure does talk a lot."
      ]
    },
    {
      "idiom": "vim and vigor",
      "meaning": "If you have vim and vigor, you have lots of energy and enthusiasm for life.",
      "examples": [
        "Our grandmother is always full of vim and vigor when we go to visit her.",
        "If you want to have lots of vim and vigor when you get older, you need to eat good food and get plenty of exercise when you're young."
      ]
    },
    {
      "idiom": "warts and all",
      "meaning": "If you show something warts and all, you show it exactly as it is without trying to hide any of its faults or weaknesses.",
      "examples": [
        "Are you sure you want to read the first draft? You'll see it warts and all, with all the mistakes and all the bad writing still there.",
        "People don't want to see an idealised version of his life. They want to know the real story, warts and all."
      ]
    },
    {
      "idiom": "weak at the knees",
      "meaning": "If you go weak at the knees, you feel an emotion so strongly that it makes you feel unstable on your feet.",
      "examples": [
        "When he looked at me and smiled, I felt weak at the knees. He was the most beautiful man I'd ever seen!",
        "Just thinking about getting up in front of a thousand people makes me weak at the knees. It's terrifying!"
      ]
    },
    {
      "idiom": "You are what you eat.",
      "meaning": "You can say \"you are what you eat\" when you want to point out the connection between food and health.",
      "examples": [
        "Why do you eat so much bad stuff like pizza, hamburgers,  fries and ice-cream? You are what you eat, you know.",
        "Shelley looks fantastic. When people ask her what her secret is, she smiles and says, \"It's simple. You are what you eat.\""
      ]
    }
  ],
  "Law": [
    {
      "idiom": "a law unto themselves",
      "meaning": "If somebody is a law unto themselves, they do things their own way and follow their own ideas about how to live instead of following what others do.",
      "examples": [
        "Our boy Billy is a law unto himself. Of course he sometimes makes mistakes and gets into trouble, but we're proud of him because he doesn't just follow the herd.",
        "Our boss does things a bit differently to most other managers, so it's no surprise that some people say he's a law unto himself."
      ]
    },
    {
      "idiom": "a slap on the wrist",
      "meaning": "If someone gives you a slap on the wrist, they give you a mild punishment for making a mistake or doing something wrong.",
      "examples": [
        "The tribunal didn't think it was a serious offence, so they just gave him a slap on the wrist. All he got was a warning.",
        "Some of our players got a slap on the wrist for getting to the training session late. The coach warned them not to be late again and then made them do twenty push-ups."
      ]
    },
    {
      "idiom": "a vested interest",
      "meaning": "If you have a vested interest in something, you have a strong personal interest in it because you stand to gain from it.",
      "examples": [
        "The Minister of Commerce is suspected of having  vested interests in several companies that have won big government contracts recently.",
        "As both a shareholder in a publishing company and a published author, the newspaper's book reviewer is seen as having vested interests in certain publishers."
      ]
    },
    {
      "idiom": "above board",
      "meaning": "If something is above board, it's been done in a legal and honest way.",
      "examples": [
        "I'm sure the deal was completely above board as I know James well and he'd never do anything illegal or corrupt.",
        "The minister claimed all the appointments were above board and denied claims that some positions had been given to his friends."
      ]
    },
    {
      "idiom": "above the law",
      "meaning": "If someone is above the law, they are not subject to the laws of a society.",
      "examples": [
        "Just because his father is a rich and powerful man, he seems to think he's above the law and he can do whatever he likes.",
        "In a democracy, no-one is above the law - not even a president or a prime-minister."
      ]
    },
    {
      "idiom": "beat the rap",
      "meaning": "If someone beats the rap, they avoid being found guilty of a crime.",
      "examples": [
        "Everyone knows that Jimmy the Snitch did the robbery in Green St., but he beat the rap because he's in with the cops.",
        "Henry was charged with drunk driving, but his lawyer helped him beat the rap on some technical detail."
      ]
    },
    {
      "idiom": "by the book",
      "meaning": "If you do something by the book, you do it strictly according to the rules or the official procedures.",
      "examples": [
        "The match officials in the golf tournament acted strictly by the book when they disqualified a player for marking down the wrong score on his score card.",
        "The embassy officials process visa applications by the book these days, so it's harder to get one than it was when they weren't so strict."
      ]
    },
    {
      "idiom": "caught red-handed",
      "meaning": "If someone is caught red-handed, they are caught in the act of doing something wrong such as cheating or stealing.",
      "examples": [
        "I used to cheat in exams until I was caught red-handed by my teacher. I stopped doing it after that.",
        "How can you say you didn't steal the book? You were caught red-handed walking out of the store after you'd hidden it under your jacket."
      ]
    },
    {
      "idiom": "cook the books | cook the accounts",
      "meaning": "If someone cooks the books, or cooks the accounts, they keep inaccurate accounts for a business, usually in order to pay less tax.",
      "examples": [
        "Their accountant was charged with cooking the books, and now he's in jail.",
        "I found this website that shows you how to cook the accounts, but I'd never try doing it."
      ]
    },
    {
      "idiom": "cover your tracks",
      "meaning": "If you cover your tracks, you make sure no-one can find evidence of what you've done.",
      "examples": [
        "He's a smart guy and he knew how to cover his tracks so the police couldn't connect him to the crime.",
        "Bob didn't cover his tracks well enough, and his wife found a romantic text message that a girl had sent to his phone."
      ]
    },
    {
      "idiom": "face the music",
      "meaning": "If someone has to face the music, they have to accept the consequences of doing something wrong.",
      "examples": [
        "To avoid facing the music and accepting his punishment for doing something bad, our little boy will tell lies with the skill of a well-trained actor.",
        "Henry stole some money and bought a car, and when he realised he'd have to face the music he drove across the border to escape."
      ]
    },
    {
      "idiom": "fall from grace",
      "meaning": "If you fall from grace, you do something that results in a loss of respect and support, especially among those who influence your life or career.",
      "examples": [
        "The company's vice-president was expected to take over the company until he fell from grace after being arrested for stealing company funds.",
        "It's been sad watching so many athletes fall from grace and have their records deleted from the record books for taking performance-enhancing drugs like steroids."
      ]
    },
    {
      "idiom": "feather your own nest",
      "meaning": "If you feather your own nest, you use your position or your job illegally for personal gain.",
      "examples": [
        "Kelly says it's accepted in many developing countries that a government official will use their position to feather their own nest, and this is why government salaries are kept so low.",
        "In some countries a person who feathers their own nest isn't seen as being dishonest or corrupt; they're seen as being clever."
      ]
    },
    {
      "idiom": "grease someone's palm",
      "meaning": "If you grease someone's palm, you pay them a bribe.",
      "examples": [
        "The only way to get a government contract around here is to grease someone's palm.",
        "If you want to get out of jail, grease the warden's palm and the guards will let you escape."
      ]
    },
    {
      "idiom": "keep your nose clean",
      "meaning": "If you keep your nose clean, you stay out of trouble by making sure you don't do anything wrong.",
      "examples": [
        "Our son Michael is in trouble with the police again. I really wish he'd learn to keep his nose clean.",
        "It's important for sport's stars to keep their noses clean because they make a lot of money for endorsing products, and they could lose this income if they got into trouble with the law."
      ]
    },
    {
      "idiom": "lay down the law",
      "meaning": "If you lay down the law, you tell people what they should do in a forceful and stern way.",
      "examples": [
        "After we lost our third game in a row, our coach got really angry and laid down the law and said we had to try harder or we'd be out the door.",
        "Shelley's parents laid down the law after she got home late and grounded her for a month."
      ]
    },
    {
      "idiom": "mend your ways",
      "meaning": "If you mend your ways, you improve your behaviour and stop doing things that cause trouble.",
      "examples": [
        "Terry had better mend his ways or Rosie will leave him forever.",
        "It took him a long time to mend his ways, but these days Jack is a good father and husband."
      ]
    },
    {
      "idiom": "red tape",
      "meaning": "Strict adherence to rules and regulations so that a procedure seems to take longer than necessary.",
      "examples": [
        "It takes a long time to set up a company in some countries because of all the red tape involved in getting government permits.",
        "It took two weeks to get visas for our aid workers because of all the red tape."
      ]
    },
    {
      "idiom": "the jury is still out",
      "meaning": "We can say the jury is still out when a decision still hasn't been made about something.",
      "examples": [
        "It was a terrible mistake, and the jury's still out on whether Bob will lose his job over it, or not.",
        "The jury's still out on who's going to be the new CEO, but we should find out soon."
      ]
    },
    {
      "idiom": "under the table",
      "meaning": "If something is done under the table, it's done secretly, usually because it's illegal or unethical.",
      "examples": [
        "If I do any overtime, can you pay me under the table so I won't have pay tax on it.",
        "If you make under-the-table payments to customs officials, you can get goods through the port without having them inspected."
      ]
    }
  ],
  "Money": [
    {
      "idiom": "(your) bread and butter",
      "meaning": "Your bread and butter is your livelihood or the source of your income.",
      "examples": [
        "Bartending is my bread and butter at the moment, but I'm trying to get into acting.",
        "The conditions are bad, but this work is their bread and butter so make sure the workers have other jobs before you close down the factory."
      ]
    },
    {
      "idiom": "a ballpark figure | a ballpark estimate",
      "meaning": "If you give a ballpark figure or a ballpark estimate, you give a number which you think is fairly close to the actual one.",
      "examples": [
        "We don't know the exact cost, but a ballpark figure would be around six million dollars.",
        "I know you can't tell me exactly when it'll be finished, but can you give me a ballpark estimate?"
      ]
    },
    {
      "idiom": "a nest egg",
      "meaning": "If you have a nest egg, you have money put away for the future.",
      "examples": [
        "When Indira inherited some money from her grandpa, she didn't spend it. She decided it was time she had a nest egg so she put it into an investment fund.",
        "Poor old Bill. He married a girl while he was in some foreign country and she got her hands on his nest egg, and now he's back here - with nothing."
      ]
    },
    {
      "idiom": "a vested interest",
      "meaning": "If you have a vested interest in something, you have a strong personal interest in it because you stand to gain from it.",
      "examples": [
        "The Minister of Commerce is suspected of having  vested interests in several companies that have won big government contracts recently.",
        "As both a shareholder in a publishing company and a published author, the newspaper's book reviewer is seen as having vested interests in certain publishers."
      ]
    },
    {
      "idiom": "cook the books | cook the accounts",
      "meaning": "If someone cooks the books, or cooks the accounts, they keep inaccurate accounts for a business, usually in order to pay less tax.",
      "examples": [
        "Their accountant was charged with cooking the books, and now he's in jail.",
        "I found this website that shows you how to cook the accounts, but I'd never try doing it."
      ]
    },
    {
      "idiom": "cost the earth | charge the earth",
      "meaning": "If something costs the earth, or they charge the earth for it, it's very expensive.",
      "examples": [
        "Just having a cup of coffee costs the earth in there. It's ridiculously expensive.",
        "Don't have anything from the little fridge in your hotel room. They charge the earth for that stuff."
      ]
    },
    {
      "idiom": "deep pockets",
      "meaning": "You can say a person or an organisation has deep pockets if they have lots of money.",
      "examples": [
        "Let's make a list of everyone we know with deep pockets, and see if any of them want to invest in our company.",
        "People think the government has very deep pockets, but in fact it's broke and it's borrowing from banks and other countries."
      ]
    },
    {
      "idiom": "dirt cheap",
      "meaning": "You can say something is dirt cheap if it costs very little money.",
      "examples": [
        "Be careful when you buy dirt cheap clothes. They could shrink easily or the colours could run when you wash them.",
        "Kevin is very tight with his money. If he has to buy someone a present, it's always something dirt cheap."
      ]
    },
    {
      "idiom": "easy come, easy go",
      "meaning": "You can say \"easy come, easy go\" to express the idea that if something comes to someone easily, such as money they get without working hard for it, they can lose it just as easily and it won't matter to them much.",
      "examples": [
        "Harry's very easy-going, especially when it comes to money. It's easy come, easy go, as far as he's concerned.",
        "The share market's been falling recently, and I've lost a fair bit of money, but it's easy come, easy go, really, because it's just money I've earned from shares in the past."
      ]
    },
    {
      "idiom": "easy money",
      "meaning": "You can say \"easy money\" to describe money that someone gets without having to make much effort.",
      "examples": [
        "Lucinda decided to become a model because it looked liked easy money just walking down a runway or having your photo taken.",
        "Many people thought they could make some easy money by selling things on the internet."
      ]
    },
    {
      "idiom": "feather your own nest",
      "meaning": "If you feather your own nest, you use your position or your job illegally for personal gain.",
      "examples": [
        "Kelly says it's accepted in many developing countries that a government official will use their position to feather their own nest, and this is why government salaries are kept so low.",
        "In some countries a person who feathers their own nest isn't seen as being dishonest or corrupt; they're seen as being clever."
      ]
    },
    {
      "idiom": "feel the pinch",
      "meaning": "If you are feeling the pinch, you're finding it harder to survive on your income.",
      "examples": [
        "Since the price of oil went up, lots of businesses have been feeling the pinch.",
        "Inflation has been pretty bad recently, so we've all been feeling the pinch."
      ]
    },
    {
      "idiom": "for my money",
      "meaning": "You can say \"for my money\" to mean the same as \"in my opinion\".",
      "examples": [
        "For my money, the best restaurant in town is the \"Ahaan Aroy\" Thai restaurant in Prescott Street.",
        "Leo reckons Sony make the best TVs, but for my money the new Panasonics are much better than Sonys."
      ]
    },
    {
      "idiom": "go out of business",
      "meaning": "If a company goes out of business, it stops trading and closes down.",
      "examples": [
        "A lot of companies went out of business during the economic recession.",
        "What will you do if your company goes out of business?"
      ]
    },
    {
      "idiom": "grease someone's palm",
      "meaning": "If you grease someone's palm, you pay them a bribe.",
      "examples": [
        "The only way to get a government contract around here is to grease someone's palm.",
        "If you want to get out of jail, grease the warden's palm and the guards will let you escape."
      ]
    },
    {
      "idiom": "in the black",
      "meaning": "If a person or a company is in the black, their assets are greater than their debts.",
      "examples": [
        "It's taken a long time, but we've paid off our loans and we're in the black again at last.",
        "If you rearrange your debts and save more than you spend, you could be in the black again within three years."
      ]
    },
    {
      "idiom": "in the red",
      "meaning": "If a person or a company is in the red, their debts are greater than their assets.",
      "examples": [
        "Even if we make a profit this year, we owe so much money that we'll probably still be in the red.",
        "I don't like being in the red, so I don't borrow money."
      ]
    },
    {
      "idiom": "kill the goose that lays the golden egg",
      "meaning": "If you kill the goose that lays the golden egg, you destroy something that has made you a lot of money.",
      "examples": [
        "The thing that attracted tourists to the island was the peace and quiet. But greedy developers have killed the goose that laid the golden egg by opening noisy nightclubs, so no-one goes there now.",
        "Parents and agents of successful child actors and singers often kill the goose that laid the golden egg by making the kids work too much, and the kids lose the magic spark that made them special in the first place."
      ]
    },
    {
      "idiom": "made of money",
      "meaning": "If you are made of money, you have lots of money.",
      "examples": [
        "When I was in poor countries, everyone thought I was made of money because I could afford to take time off work and travel so far to their country.",
        "That guy Howard acts as if he's made of money, but I know for a fact that he's actually quite poor."
      ]
    },
    {
      "idiom": "make a killing",
      "meaning": "If you make a killing, you make a lot of money from a sale or a deal of some sort.",
      "examples": [
        "My aunt made a killing when she bought some shares in a company as soon as they were issued, and sold them a few weeks later for three times what she paid.",
        "Lots of people made a killing when property values went so high back in the nineties."
      ]
    },
    {
      "idiom": "make ends meet",
      "meaning": "If you make ends meet, you earn just enough to pay for a place to live and your daily expenses.",
      "examples": [
        "My wife and I both have to work full-time just to make ends meet these days.",
        "Does the government really think elderly people can make ends meet on their pensions?"
      ]
    },
    {
      "idiom": "pay the price",
      "meaning": "You pay the price for doing something when you experience the unpleasant results of doing it.",
      "examples": [
        "You mightn't feel the effects of smoking cigarettes while you're young, but you'll definitely pay the price when you're older.",
        "Martin thinks that growing up means knowing that you have to pay the price for doing certain things, and then making good choices based on that knowledge."
      ]
    },
    {
      "idiom": "pay through the nose",
      "meaning": "If you pay through the nose for something, you pay more than the usual price for it.",
      "examples": [
        "I know I pay through the nose for my dental work, but the dentist I see is supposed to be the best, so I don't mind paying more than usual.",
        "We had to pay through the nose for our room because it was a long weekend and most of the hotels were fully booked."
      ]
    },
    {
      "idiom": "pick up the tab | pick up the bill",
      "meaning": "If you pick up the tab, or pick up the bill, you pay for yourself and your friends in a restaurant or a bar.",
      "examples": [
        "When people go out to celebrate a birthday in Thailand, whoever's having the birthday picks up the tab.",
        "In general in Asia, the person with the highest status picks up the bill in a restaurant."
      ]
    },
    {
      "idiom": "rags to riches",
      "meaning": "If you go from rags to riches, you start out very poor and you become very rich.",
      "examples": [
        "My grandfather went from rags to riches when his dishwashing liquid became very popular. He started out making it at home, but in less than a year he had his own factory.",
        "Most of these young guys in professional basketball came from poor neighbourhoods and they all have the same rags-to-riches story."
      ]
    },
    {
      "idiom": "talk turkey",
      "meaning": "If you talk turkey, you discuss something seriously, usually to do with business or money.",
      "examples": [
        "After the owner had shown him around the apartment, Shane decided it was just what he wanted, so he said, \"OK, I'm interested. Let's talk turkey.\"",
        "I started to say something about the deal, but Mr Hamilton said, \"Not now, my boy. We never talk turkey at the dinner table.\""
      ]
    },
    {
      "idiom": "tighten your belt",
      "meaning": "If you tighten your belt, you try to spend less money.",
      "examples": [
        "I'll have to tighten my belt for a while so I can pay off my debts.",
        "Pablo says his family have had to tighten their belts because everything costs much more now."
      ]
    },
    {
      "idiom": "under the table",
      "meaning": "If something is done under the table, it's done secretly, usually because it's illegal or unethical.",
      "examples": [
        "If I do any overtime, can you pay me under the table so I won't have pay tax on it.",
        "If you make under-the-table payments to customs officials, you can get goods through the port without having them inspected."
      ]
    },
    {
      "idiom": "wheeling and dealing",
      "meaning": "If you're wheeling and dealing, you're involved in the complex world of making deals and exchanging favours in business or politics, or both.",
      "examples": [
        "You'll need to be good at wheeling and dealing if you want to do well in politics.",
        "The amount of wheeling and dealing that's needed to sort out a contract with the local government is incredible."
      ]
    },
    {
      "idiom": "worth its weight in gold",
      "meaning": "If something is worth its weight in gold, it is extremely valuable or extremely useful.",
      "examples": [
        "Your grandmother's stories are worth their weight in gold, so you should try to record them or write them down.",
        "A personal recommendation from someone like Professor Clark is worth its weight in gold. You'll be able to get a job anywhere you like with that."
      ]
    }
  ],
  "Music": [
    {
      "idiom": "a jam session",
      "meaning": "If musicians play in a jam session, they play whatever they feel like playing in an informal setting.",
      "examples": [
        "I have wonderful memories of joining in late-night jam sessions in New York jazz clubs with some really great musicians.",
        "Why don't you come over on Sunday and have a jam session with me and the band?"
      ]
    },
    {
      "idiom": "blow your own horn | blow your own trumpet",
      "meaning": "If you blow your own horn, or blow your own trumpet, you proudly boast about your own talents and successes.",
      "examples": [
        "I hate the way Barry always blows his own horn, and I get sick of hearing about all the amazing things he's done.",
        "Lorraine says that if you want to be successful in the fashion business, you really have to blow your own trumpet."
      ]
    },
    {
      "idiom": "change your tune",
      "meaning": "If you change your tune, you change your opinion about something or your attitude towards someone.",
      "examples": [
        "At first Bill was against selling the rights to his book, but he changed his tune when he realized how much money he could make.",
        "Kelly was quite rude to me at first, but she changed her tune when someone mentioned how wealthy I was."
      ]
    },
    {
      "idiom": "face the music",
      "meaning": "If someone has to face the music, they have to accept the consequences of doing something wrong.",
      "examples": [
        "To avoid facing the music and accepting his punishment for doing something bad, our little boy will tell lies with the skill of a well-trained actor.",
        "Henry stole some money and bought a car, and when he realised he'd have to face the music he drove across the border to escape."
      ]
    },
    {
      "idiom": "for a song",
      "meaning": "If you buy or sell something for a song, you buy or sell it at a very cheap price.",
      "examples": [
        "When I was in Vietnam I bought some beautiful lacquerware for a song. I still can't believe how cheap it was.",
        "James had a really valuable record by an old American band called The Cramps, but he sold it for a song at a garage sale. He didn't know how much it was worth."
      ]
    },
    {
      "idiom": "make a song and dance about something",
      "meaning": "If you make a song and dance about something, you make a big deal out of, or a fuss over, something that isn't very important.",
      "examples": [
        "Why are people making such a song and dance about the fact that the health minister used to smoke cigarettes? You'd think he'd worshipped the devil from the way they're carrying on about it!",
        "Carol thinks people should be angry about the injustices in the world, but instead they make a song and dance about things like the high price of bananas."
      ]
    },
    {
      "idiom": "music to your ears",
      "meaning": "If something is music to your ears, it's just what you want to hear.",
      "examples": [
        "When Halle heard Jason say \"I do\" at their wedding, it was music to her ears.",
        "After I'd done my final dive, the judges all said 9.9 or 10 and the crowd cheered. It was music to my ears!"
      ]
    },
    {
      "idiom": "play it by ear",
      "meaning": "If you play it by ear, you don't plan ahead but you do whatever seems best at the time depending on the situation.",
      "examples": [
        "I like those comedy shows where they play it by ear and just say whatever they like and do whatever they like.",
        "Jean says he's not sure what goes on in the meetings, so he'll just play it by ear and see what happens."
      ]
    },
    {
      "idiom": "pull out all the stops",
      "meaning": "If you pull out all the stops, you do everything you can to make sure something is successful.",
      "examples": [
        "They pulled out all the stops for the launch of their new range of perfumes, and even paid movie stars to come along.",
        "The Chinese government pulled out all the stops in their efforts to make the Beijing Olympics the best Olympic Games ever."
      ]
    },
    {
      "idiom": "ring a bell",
      "meaning": "If something rings a bell, it sounds familiar or you think you've heard it before.",
      "examples": [
        "The name rang a bell but I couldn't remember exactly where I'd heard it before.",
        "Does the name \"Hunter S. Thompson\" ring a bell?"
      ]
    }
  ],
  "Nature": [
    {
      "idiom": "a drop in the ocean",
      "meaning": "If an amount is a drop in the ocean, it's a very small portion of the amount that's needed.",
      "examples": [
        "Our government's sending a thousand tons of food, but that's just a drop in the ocean compared to what's needed.",
        "I know twenty dollars is just a drop in the ocean, but if everyone gave that much it'd make a big difference."
      ]
    },
    {
      "idiom": "a ray of sunshine",
      "meaning": "Something is a ray of sunshine if it brings happiness to someone.",
      "examples": [
        "The birth of Debra's first grandchild less than a year after her husband died came as a much-needed ray of sunshine in her life.",
        "After years of struggling to get established as a writer, the publication of her first short story was a ray of sunshine for Ruth."
      ]
    },
    {
      "idiom": "a voice (crying) in the wilderness",
      "meaning": "You're a voice in the wilderness, or a voice crying in the wilderness, if you're expressing an unpopular opinion or insight.",
      "examples": [
        "When Galileo stated that the sun was the centre of the solar system, he was a voice crying in the wilderness. Most people thought he was crazy or evil, or possibly both.",
        "Clara says petrol engines should be banned because of the damage they cause to the environment. She says most people laugh when she says this, and she feels like a voice in the wilderness."
      ]
    },
    {
      "idiom": "answer the call of nature",
      "meaning": "If you answer the call of nature, you go to the toilet.",
      "examples": [
        "Could we stop somewhere? I need to answer the call of nature.",
        "Does anyone need to answer the call of nature before we set off?"
      ]
    },
    {
      "idiom": "at sea | all at sea",
      "meaning": "If you're at sea, or all at sea, you're confused about something and not sure what to do.",
      "examples": [
        "I'm all at sea with our new spreadsheet software. I just can't understand it.",
        "For the first few days in her new job, Gail felt totally at sea. She didn't know what to do or who to ask for help."
      ]
    },
    {
      "idiom": "beat around the bush | beat about the bush",
      "meaning": "If you beat around the bush, or beat about the bush, you don't say something directly, usually because you don't want to upset the person you're talking to.",
      "examples": [
        "I had trouble telling Pedro he'd lost his job. I started beating around the bush and talking about one door closing and another door opening.",
        "Stop beating about the bush. Just tell me what's happened!"
      ]
    },
    {
      "idiom": "can't see the forest for the trees",
      "meaning": "If you can't see the forest for the trees, you can't see the whole situation clearly because you're looking too closely at small details, or because you're too closely involved.",
      "examples": [
        "I don't think we can see the forest for the trees at this stage, so let's get an outsider to take a look at the project and give us a progress report.",
        "Mark is so focused on product details that he can't see the forest for the trees when it comes to the overall needs of the company."
      ]
    },
    {
      "idiom": "can't see the wood for the trees",
      "meaning": "If you can't see the wood for the trees, you can't see the whole situation clearly because you're looking too closely at small details, or because you're too closely involved.",
      "examples": [
        "I don't think we can see the wood for the trees at this stage, so let's get an outsider to take a look at the project and give us a progress report.",
        "Marcus is so focused on product details that he can't see the wood for the trees when it comes to the overall needs of the company."
      ]
    },
    {
      "idiom": "down to earth",
      "meaning": "If someone is down to earth, they are practical and sensible.",
      "examples": [
        "Steven is an artist and a real dreamer, but luckily his wife Sarah is down to earth, so she takes care of their day-to-day lives.",
        "We need someone who can come up with practical, down-to-earth ideas that we can work with in the real world."
      ]
    },
    {
      "idiom": "go with the flow",
      "meaning": "If you go with the flow, you relax and go along with whatever is happening.",
      "examples": [
        "Jareem says that if you go with the flow in life, you don't plan everything ahead but you take opportunities as they arise.",
        "Don't you find that everything goes better when you go with the flow instead of trying to force things to happen?"
      ]
    },
    {
      "idiom": "in deep water",
      "meaning": "If you're in deep water, you're in some sort of trouble or in a difficult situation.",
      "examples": [
        "The company's in deep water now that the tax inspectors have decided to check over the accounts.",
        "Many families are in deep water because of the mortgage crisis, and some might even lose their homes."
      ]
    },
    {
      "idiom": "make a mountain out of a molehill",
      "meaning": "If you make a mountain out of a molehill, you make a small problem seem to be a much bigger problem.",
      "examples": [
        "You've just got a cold so stop making a mountain out of a molehill. You're not going to die from it!",
        "Come on, you only lost $10. It's not that much, so I think you might be making a mountain out of a molehill."
      ]
    },
    {
      "idiom": "make hay while the sun shines",
      "meaning": "If you make hay while the sun shines, you make good use of the chance to do something while it lasts.",
      "examples": [
        "We've got a few days off work so lets make hay while the sun shines and do some landscaping around the back of the house.",
        "Jim works too much, but he reckons he's just making hay while the sun shines. He says he'll slow down once he's made his fortune."
      ]
    },
    {
      "idiom": "neck of the woods",
      "meaning": "A neck of the woods is a neighbourhood or a district, usually rural.",
      "examples": [
        "What brings you to our neck of the woods?",
        "Have land prices gone up in your neck of the woods too?"
      ]
    },
    {
      "idiom": "reach for the moon | reach for the stars",
      "meaning": "If you reach for the moon, or reach for the stars, you are aiming to achieve something great, or do something very challenging.",
      "examples": [
        "Ever since he was a little boy, Gustav had reached for the moon. It was as if he'd somehow known that he would do great things in his life.",
        "Her father always wanted Sylvia to reach for the stars, but Sylvia just wanted to play with her pets and run around in the woods."
      ]
    },
    {
      "idiom": "the tip of the iceberg",
      "meaning": "You can say something is the tip of the iceberg when it's just a small part of something much bigger.",
      "examples": [
        "The homeless kids who visit us for help are just the tip of the iceberg. There are thousands more we never see.",
        "The internet is huge. What you can find through search engines is just the tip of the iceberg."
      ]
    },
    {
      "idiom": "under a cloud",
      "meaning": "If someone is under a cloud, they are suspected of having done something wrong.",
      "examples": [
        "Ever since the rumours of corruption started, the president has been under a cloud and he probably won't win another election.",
        "Henry has been under a cloud since the money disappeared and he bought a new car."
      ]
    },
    {
      "idiom": "under the weather",
      "meaning": "If you are under the weather, you're not feeling well.",
      "examples": [
        "Hiroko's feeling a bit under the weather. He thinks he might have the flu.",
        "Sorry, but I don't think I'll be able to make it to work today. I'm feeling a bit under the weather."
      ]
    },
    {
      "idiom": "virgin territory",
      "meaning": "You can say something is virgin territory if it's never been explored before or never been done before.",
      "examples": [
        "The internet was still virgin territory when we made our first websites.",
        "Our company has designed many products for other companies, but producing them and marketing them ourselves is virgin territory for us."
      ]
    },
    {
      "idiom": "weather a storm",
      "meaning": "If you weather a storm, you survive a dangerous event or deal with a difficult situation.",
      "examples": [
        "Everyone waited to see if the president could weather the storm caused by his son's arrest for using illegal drugs.",
        "Poor Mandy had to stand there and weather the storm as her boss shouted insults at her for letting him forget something."
      ]
    }
  ],
  "Numbers": [
    {
      "idiom": "a ballpark figure | a ballpark estimate",
      "meaning": "If you give a ballpark figure or a ballpark estimate, you give a number which you think is fairly close to the actual one.",
      "examples": [
        "We don't know the exact cost, but a ballpark figure would be around six million dollars.",
        "I know you can't tell me exactly when it'll be finished, but can you give me a ballpark estimate?"
      ]
    },
    {
      "idiom": "a one-track mind",
      "meaning": "If someone has a one-track mind, they spend most of their time thinking about one subject.",
      "examples": [
        "Brian's had a one-track mind since he started his own company. All he thinks about now is business and making money.",
        "Mark's upset because Jenny said he's got a one-track mind and he's always thinking about sex."
      ]
    },
    {
      "idiom": "against all odds | against all the odds",
      "meaning": "If you do something against all odds, or against all the odds, you do it even though there were many problems and it didn't seem possible to do.",
      "examples": [
        "He had a serious accident and was close to death  but, against all odds, he recovered and now he's fine.",
        "No-one thought we could do it but, against all the odds, we won the Olympic gold medal."
      ]
    },
    {
      "idiom": "back to square one",
      "meaning": "If you have to go back to square one, you have to stop and start again, usually because something isn't working as well as expected.",
      "examples": [
        "We were going to start the new company next month, but it's back to square one now that Omar has changed his mind about investing in it.",
        "After they lost the election, the Liberal Party had to go back to square one and come up with some new policies and some new ideas."
      ]
    },
    {
      "idiom": "behind the eight ball",
      "meaning": "If you're behind the eight ball, you're in a difficult or dangerous position.",
      "examples": [
        "The economic recession has really put our new business behind the eight ball. Nobody's spending money.",
        "Carlo is behind the eight ball now because his final exam is in two days and he still hasn't started studying for it."
      ]
    },
    {
      "idiom": "dressed (up) to the nines",
      "meaning": "If you are dressed to the nines, or dressed up to the nines, you are wearing very smart clothes for a special occasion.",
      "examples": [
        "Have you seen Harry? He's dressed to the nines and he looks amazing.",
        "Everyone was dressed up to the nines for the Academy Awards, with the men in tuxedos and the women in evening gowns."
      ]
    },
    {
      "idiom": "forty winks",
      "meaning": "If you have forty winks, you have a short sleep, or a nap.",
      "examples": [
        "If I have a late night I sometimes catch forty winks on the train on the way to work.",
        "If you're driving on a long trip and you feel yourself getting sleepy, stop and have forty winks. It might save your life, and the lives of other people too."
      ]
    },
    {
      "idiom": "have second thoughts",
      "meaning": "If you're having second thoughts about something, you're having doubts about a decision you've made.",
      "examples": [
        "You're not having second thoughts about moving to Australia to live, are you?",
        "I've been having second thoughts about quitting my job. Maybe I should keep it for a while longer."
      ]
    },
    {
      "idiom": "I owe you one!",
      "meaning": "You can say \"I owe you one!\" when someone has done something for you and you'd be happy to return the favour one day.",
      "examples": [
        "Thanks for helping me out, Bob. I owe you one!",
        "\"I owe you one!\" said Malik after I'd told him to sell his shares just before the market collapsed."
      ]
    },
    {
      "idiom": "in two minds",
      "meaning": "If you're in two minds about something, you can't decide what to do, or  you can't decide which option is the best.",
      "examples": [
        "Kenny is in two minds about what to study at university. He's interested in history, but he also likes the idea of being a lawyer.",
        "We're in two minds about what to do during our vacation. We could go travelling somewhere, or we could stay home and fix up the garden."
      ]
    },
    {
      "idiom": "kill two birds with one stone",
      "meaning": "If you kill two birds with one stone, you achieve two things with the one action.",
      "examples": [
        "I need to go to the bank, and if I drop the books off at the library on the way I'll be killing two birds with one stone.",
        "Jenny says that she kills two birds with one stone if she does her own housework because she gets the house clean and she gets some exercise at the same time."
      ]
    },
    {
      "idiom": "once and for all",
      "meaning": "If you do something once and for all, you do it in a way that's final and it means you'll never have to do it again.",
      "examples": [
        "Jim said he's decided once and for all that he's going to stay single and never get married again.",
        "I was tired of getting new glasses every few years so I decided to solve my eyesight problem once and for all and have laser surgery."
      ]
    },
    {
      "idiom": "once in a blue moon",
      "meaning": "If something happens once in a blue moon, it happens very rarely.",
      "examples": [
        "We hardly ever go out these days, though once in a blue moon we might go and see a movie.",
        "My daughter lives in Brazil and she only comes to see us once in a blue moon; maybe every two or three years if we're lucky."
      ]
    },
    {
      "idiom": "one in a million",
      "meaning": "If you say someone is \"one in a million\", you mean they're an exceptionally good person.",
      "examples": [
        "My grandmother was the kindest and sweetest old lady ever. She was one in a million.",
        "Kenny was a really great guy. One in a million, he was."
      ]
    },
    {
      "idiom": "par for the course",
      "meaning": "If something is par for the course, it's what you'd expect it to be.",
      "examples": [
        "Bill hasn't paid his rent on time, but that's par for the course. He's always late.",
        "I had an appointment to see my doctor at three but I had to wait an hour. I know waiting is par for the course when it comes to doctors, but it still annoys me."
      ]
    },
    {
      "idiom": "put all your eggs in the one basket",
      "meaning": "If you put all your eggs in the one basket, you put all your efforts or resources into one person, one thing or one plan, and if things don't work out, you lose everything.",
      "examples": [
        "My stockbroker says I should buy shares in a lot of different companies, and not put all my eggs in the one basket.",
        "Our company should distribute many different products from many different companies. If we put all our eggs in the one basket, we'll get into trouble if there's a problem with that one product or company."
      ]
    },
    {
      "idiom": "year dot | year one",
      "meaning": "You can say \"the year dot\", or \"the year one\", when you're talking about a very, very long time ago.",
      "examples": [
        "There have been people living in Australia since the year dot, but Europeans have only been there for about two hundred years.",
        "People have been interested in the stars and the moon since the year one."
      ]
    },
    {
      "idiom": "zero in on",
      "meaning": "If you zero in on something, you focus your attention on it.",
      "examples": [
        "If you're reporting on an issue rather than an event, first get the reader interested by zeroing in on the main players and their conflict.",
        "I like the way our lecturer zeroes in on the central issues without spending too much time on all that boring background information."
      ]
    },
    {
      "idiom": "zero tolerance",
      "meaning": "If something is given zero tolerance, it won't be accepted even once.",
      "examples": [
        "Because of the school's zero-tolerance policy, our boy was expelled for smoking just one cigarette.",
        "How can a society based on Christian morals and forgiveness of sin have a zero-tolerance approach to petty crime?"
      ]
    },
    {
      "idiom": "zero-sum game",
      "meaning": "A zero-sum game is a situation in which any gain by one side or person  is at the expense of a loss to another side or person involved in the situation.",
      "examples": [
        "The stock market has become a giant zero-sum game in which one investor gains what another investor loses.",
        "In a zero-sum game, if you add the total gains of the participants and the total losses of the participants, the sum will always be zero."
      ]
    }
  ],
  "Plants": [
    {
      "idiom": "bark up the wrong tree",
      "meaning": "If you're barking up the wrong tree, you're looking for something in the wrong place or going about something in the wrong way.",
      "examples": [
        "The police think the drugs are being brought in by the mafia, but they're barking up the wrong tree. They should be looking much closer to home.",
        "She's barking up the wrong tree if she's interested in Gavin. Doesn't she know he's gay?"
      ]
    },
    {
      "idiom": "beat around the bush | beat about the bush",
      "meaning": "If you beat around the bush, or beat about the bush, you don't say something directly, usually because you don't want to upset the person you're talking to.",
      "examples": [
        "I had trouble telling Pedro he'd lost his job. I started beating around the bush and talking about one door closing and another door opening.",
        "Stop beating about the bush. Just tell me what's happened!"
      ]
    },
    {
      "idiom": "can't see the wood for the trees",
      "meaning": "If you can't see the wood for the trees, you can't see the whole situation clearly because you're looking too closely at small details, or because you're too closely involved.",
      "examples": [
        "I don't think we can see the wood for the trees at this stage, so let's get an outsider to take a look at the project and give us a progress report.",
        "Marcus is so focused on product details that he can't see the wood for the trees when it comes to the overall needs of the company."
      ]
    },
    {
      "idiom": "Everything's coming up roses.",
      "meaning": "you can say \"everything's coming up roses\" if everything is turning out very well for someone or for something.",
      "examples": [
        "Everything's coming up roses this year. Our business is doing well, our son Brett got into college, and Josie's had her first baby - so we're grandparents as well!",
        "It looks like everything's coming up roses for Manchester United this year. They've won the Premiership, the Carling Cup, and now they're in the Euro Cup final as well!"
      ]
    },
    {
      "idiom": "fresh as a daisy",
      "meaning": "If you feel as fresh as a daisy, you feel energetic and lively.",
      "examples": [
        "I might look awful first thing in the morning, but after a cup of tea and a bit of meditation I'm as fresh as a daisy.",
        "George looked terrible when he got to work, so Annie said, \"Fresh as a daisy this morning, are we?\" and George just grunted."
      ]
    },
    {
      "idiom": "go out on a limb",
      "meaning": "If you go out on a limb, you put yourself in a risky position in order to support someone or something.",
      "examples": [
        "He knew it could damage his career, but Keith went out on a limb and said he supported the anti-war protesters.",
        "I don't think that saying you support gay rights means you're going out on a limb these days."
      ]
    },
    {
      "idiom": "make hay while the sun shines",
      "meaning": "If you make hay while the sun shines, you make good use of the chance to do something while it lasts.",
      "examples": [
        "We've got a few days off work so lets make hay while the sun shines and do some landscaping around the back of the house.",
        "Jim works too much, but he reckons he's just making hay while the sun shines. He says he'll slow down once he's made his fortune."
      ]
    },
    {
      "idiom": "nip it in the bud",
      "meaning": "If you nip something in the bud, you stop a problem from becoming serious by dealing with it as soon as you notice it.",
      "examples": [
        "Alan has a serious weight problem. Now he wishes he'd nipped it in the bud by eating less and exercising more when he was first starting to put on weight.",
        "I was starting to drink too much alcohol, so I nipped it in the bud and stopped drinking altogether before it became a serious problem."
      ]
    },
    {
      "idiom": "the cream of the crop",
      "meaning": "If something or someone is in the cream of the crop, they are among the best of a class of things or people.",
      "examples": [
        "The cream of the crop of this year's high-school graduates will get into the best universities, as usual.",
        "We're only interested in the cream of the crop, so don't send us any second-rate samples."
      ]
    },
    {
      "idiom": "up a gum tree",
      "meaning": "If you're up a gum tree, you're in trouble or have a serious problem.",
      "examples": [
        "The company is up a gum tree because they broke some laws about polluting the environment, and they'll probably get closed down.",
        "My mate Bruce is up a gum tree. He got a sheila up the duff and now she's twisting his arm to get hitched. (see Note 2 below)"
      ]
    }
  ],
  "Sports": [
    {
      "idiom": "a ballpark figure | a ballpark estimate",
      "meaning": "If you give a ballpark figure or a ballpark estimate, you give a number which you think is fairly close to the actual one.",
      "examples": [
        "We don't know the exact cost, but a ballpark figure would be around six million dollars.",
        "I know you can't tell me exactly when it'll be finished, but can you give me a ballpark estimate?"
      ]
    },
    {
      "idiom": "across the board",
      "meaning": "If something is across the board, it relates to all without exception.",
      "examples": [
        "The company has promised to increase salaries across the board, so everyone will get a pay rise.",
        "The tax cuts will only apply to low and middle-income families, so they won't be across the board."
      ]
    },
    {
      "idiom": "ahead of the game",
      "meaning": "You are ahead of the game if you have an advantage over your competitors in any activity in which you try to do better than others, such as in business, academia, sports, etc.",
      "examples": [
        "We got ahead of the game by employing the best people in our research laboratories.",
        "You'll be ahead of the game when you start at university if you do a lot of preparation before the term begins."
      ]
    },
    {
      "idiom": "another string to your bow",
      "meaning": "If you have another string to your bow, you have another way of making a living.",
      "examples": [
        "Lots of people learn to teach English so they'll have another string to their bow.",
        "I've lost my job and I'll have to retrain for something else. I wish I already had another string to my bow."
      ]
    },
    {
      "idiom": "behind the eight ball",
      "meaning": "If you're behind the eight ball, you're in a difficult or dangerous position.",
      "examples": [
        "The economic recession has really put our new business behind the eight ball. Nobody's spending money.",
        "Carlo is behind the eight ball now because his final exam is in two days and he still hasn't started studying for it."
      ]
    },
    {
      "idiom": "get off on the wrong foot",
      "meaning": "If you get off on the wrong foot, you start something poorly, or begin with a mistake.",
      "examples": [
        "I got off on the wrong foot in my new job when I forgot to pass on an important message to the boss.",
        "Helen got off on the wrong foot in her performance when she forgot the first few words of the song."
      ]
    },
    {
      "idiom": "jump the gun",
      "meaning": "If you jump the gun, you start doing something too soon.",
      "examples": [
        "If you're in a debate, wait until you're invited to speak and don't jump the gun by speaking before you should.",
        "The company jumped the gun and released the product before the public was ready for it."
      ]
    },
    {
      "idiom": "jump through hoops | go through hoops",
      "meaning": "You can say you had to \"jump through hoops\" or \"go through hoops\" if you had to complete a lot of tasks before being permitted to do something.",
      "examples": [
        "The insurance company made me jump through hoops before they'd give me a health insurance policy. I had to do medical tests, questionnaires, interviews - you name it!",
        "The defence department makes you go through hoops before they give you clearance to work in one of their special sections."
      ]
    },
    {
      "idiom": "no holds barred",
      "meaning": "If something is done with no holds barred, it's done without restriction, rules or restraint.",
      "examples": [
        "The final game was played with no holds barred. It was very rough football and the referee had a hard time keeping control of things.",
        "The election campaign turned into a no-holds-barred battle with each candidate trying to find information with which to damage their opponent's reputation."
      ]
    },
    {
      "idiom": "off your own bat",
      "meaning": "If you do something off your own bat, you do it without being asked to or told to.",
      "examples": [
        "I didn't tell the gardener to cut down the tree. He did it off his own bat.",
        "One of the actresses decided, off her own bat, to change her lines in the movie. The director wasn't happy."
      ]
    },
    {
      "idiom": "on the ball",
      "meaning": "If you're on the ball, you're alert and you know what's going on around you.",
      "examples": [
        "I didn't get much sleep last night so I'm not really on the ball today.",
        "My brother is always on the ball, so it's hard to trick him or catch him unawares."
      ]
    },
    {
      "idiom": "par for the course",
      "meaning": "If something is par for the course, it's what you'd expect it to be.",
      "examples": [
        "Bill hasn't paid his rent on time, but that's par for the course. He's always late.",
        "I had an appointment to see my doctor at three but I had to wait an hour. I know waiting is par for the course when it comes to doctors, but it still annoys me."
      ]
    },
    {
      "idiom": "plain sailing",
      "meaning": "If something is plain sailing, it's very easy to do and there are no problems to overcome.",
      "examples": [
        "Golfer Tiger Woods hit a couple of bad shots early in his round, but it was plain sailing after that and he won the match easily.",
        "I answered the first few questions in the exam without any problems, and I knew it'd be plain sailing from then on."
      ]
    },
    {
      "idiom": "quick off the mark",
      "meaning": "If you are quick off the mark, you are quick to react to an event or an opportunity.",
      "examples": [
        "Steven was quick off the mark when the internet started. He had his first website up and running before most people had even tried email.",
        "Bobby is always quick off the mark when a girl comes into the bar. He's offering her a drink before most of us have even noticed her."
      ]
    },
    {
      "idiom": "run rings around | run circles around",
      "meaning": "If you run rings around someone, or run circles around them, you do something much better than they do.",
      "examples": [
        "The Democrat candidate ran rings around the Republican candidate in their debate on the economy.",
        "We watched this dance contest and some kid from Brixton ran circles around a guy from Chelsea."
      ]
    },
    {
      "idiom": "skate on thin ice",
      "meaning": "If you're skating on thin ice, you're doing something risky, or you're in a situation that could quickly become dangerous.",
      "examples": [
        "Don't you think you'll be skating on thin ice if you go to the U.S. without getting health insurance? Medical care is incredibly expensive there.",
        "Kenny's skating on thin ice. He's already on parole, and yet he's still driving around without a licence."
      ]
    },
    {
      "idiom": "the ball's in your court",
      "meaning": "If someone you're negotiating with says \"the ball's in your court\", they think it's your turn to make a move or make an offer.",
      "examples": [
        "We've offered him ten thousand dollars a month, so the ball's in his court now.",
        "They know our position, so the ball's in their court. If they want to pursue the matter, they'll have to make the next move."
      ]
    },
    {
      "idiom": "the name of the game",
      "meaning": "You can say something is the name of the game if it's the most important thing you need to know or to have in order to succeed at something.",
      "examples": [
        "In long-distance running, the name of the game is stamina and fitness. No matter how hard you try, if you haven't trained hard and become extremely fit, you cannot win.",
        "The name of the game in the fashion industry is knowing the right people. Even if you have the best designs, you won't succeed unless the people who matter see them."
      ]
    },
    {
      "idiom": "wide of the mark",
      "meaning": "If something is wide of the mark, it isn't true or accurate, or it misses the target.",
      "examples": [
        "The manager expected sales to double this year, but  his prediction was wide of the mark. They only increased by ten per cent.",
        "Ronaldo's first shot was wide of the mark, but his second one went right into the back of the net for a goal."
      ]
    },
    {
      "idiom": "You can't win them all.",
      "meaning": "Something you can say after you, or someone else, loses a contest or fails to achieve something (said to make losing seem not so bad).",
      "examples": [
        "After Terry had lost the match, his wife said, \"Never mind, dear. You can't win them all.\"",
        "When it was clear that we hadn't won the contract, I   tried to hide my disappointment by saying, \"Oh well. You can't win 'em all.\""
      ]
    }
  ],
  "Structures": [
    {
      "idiom": "a ballpark figure | a ballpark estimate",
      "meaning": "If you give a ballpark figure or a ballpark estimate, you give a number which you think is fairly close to the actual one.",
      "examples": [
        "We don't know the exact cost, but a ballpark figure would be around six million dollars.",
        "I know you can't tell me exactly when it'll be finished, but can you give me a ballpark estimate?"
      ]
    },
    {
      "idiom": "a night on the town | out on the town",
      "meaning": "If you have a night on the town, or go out on the town, you go out for dinner and then go to a show or a dance club or some other entertainment venue.",
      "examples": [
        "Let's go out for a night on the town. We haven't been out for ages.",
        "It's quite common for businessmen to take their colleagues out on the town."
      ]
    },
    {
      "idiom": "a roller coaster | a roller-coaster ride",
      "meaning": "You can say an experience is a roller coaster, or a roller-coaster ride, if it involves many emotional highs and lows, or really good times alternating with really difficult times.",
      "examples": [
        "The movie follows a young guy's emotional roller-coaster ride as he tries to come to terms with being gay in a small town in Australia.",
        "Eric writes about the roller coaster of rock and roll, with the highs of success and fame followed by the lows of drug addiction and depression."
      ]
    },
    {
      "idiom": "burn your bridges | burn your boats",
      "meaning": "You have burned your bridges, or burned your boats, if you were in a situation and you then left it after doing something that made it impossible to go back there.",
      "examples": [
        "If you insult the boss when you leave, you'll be burning your bridges and you'll never be able to go back to work there again.",
        "I knew I'd be burning my boats if I dropped out of school, but I didn't care because I was determined to be a photographer."
      ]
    },
    {
      "idiom": "cross that bridge when we come to it",
      "meaning": "You can say \"we'll cross that bridge when we come to it\" if someone mentions a problem that might occur in the future, but you want them to think about what's happening now instead.",
      "examples": [
        "Martin asked what we'd do if our new company couldn't find good staff when we needed to expand, and I said we'll cross that bridge when we come to it.",
        "Jenny worries too much about things that might happen in the future, so people are always saying \"We'll cross that bridge when we come to it\" to her."
      ]
    },
    {
      "idiom": "light at the end of the tunnel",
      "meaning": "If you can see light at the end of the tunnel, you can see some sign of the end of a difficult period.",
      "examples": [
        "After the leaders met for talks, people are seeing light at the end of the tunnel for the first time since the war began.",
        "Even if you can't see any light at the end of the tunnel yet, don't give up. Things will eventually get better."
      ]
    },
    {
      "idiom": "paint the town red",
      "meaning": "If you paint the town red, you visit bars, nightclubs and other nightspots to have a good time.",
      "examples": [
        "It's Ian's birthday so he's going out with some friends tonight to paint the town red.",
        "Going out and painting the town red is great fun, but you can't do it every night."
      ]
    },
    {
      "idiom": "the new kid on the block",
      "meaning": "If you are the new kid on the block, you are the newest person in a workplace or in an educational institute, or any other place or organization.",
      "examples": [
        "Have you met Brigette? She's the new kid on the block - just started working here today.",
        "Paula hates being the new kid on the block. She finds meeting lots of new people stressful, and she gets nervous when she thinks that everyone is looking at her and trying to decide if they like her."
      ]
    },
    {
      "idiom": "under lock and key",
      "meaning": "If something is under lock and key, it is kept in a very secure place.",
      "examples": [
        "Make sure these documents are under lock and key until we need them.",
        "Poor Josie. Her parents were very strict and they kept her under lock and key throughout her childhood, so she never learned about life's dangers."
      ]
    },
    {
      "idiom": "water under the bridge | water over the dam",
      "meaning": "You can say a problem or an experience is water under the bridge, or water over the dam, if it happened in the past and it no longer affects the present to a degree that is worth worrying about.",
      "examples": [
        "I wish people would stop talking about my problems with the law. It all happened a long time ago and it's water under the bridge as far as I'm concerned.",
        "Rhonda says her marriage to Mark is water over the dam and it's time to move on with her life."
      ]
    }
  ],
  "Time": [
    {
      "idiom": "a question of time",
      "meaning": "You can say \"it's only a question of time\" before saying what you think will happen in the future.",
      "examples": [
        "It's only a question of time until we run out of oil, so we're going to need other forms of energy to power our cars.",
        "If you keep on spending money like this, it'll just be a question of time before you have a serious debt problem."
      ]
    },
    {
      "idiom": "a whale of a time",
      "meaning": "If you have a whale of a time, you have a great time and really enjoy yourself.",
      "examples": [
        "I went to a karaoke club with my friends last night and we had a whale of a time. It was great!",
        "Janet said she had a whale of a time at the party. I wish I'd gone too now."
      ]
    },
    {
      "idiom": "around the clock",
      "meaning": "If something occurs around the clock, it goes on all day and all night.",
      "examples": [
        "I have to finish this report by Tuesday, so I'll be working around the clock until I get it done.",
        "What the young people of this town need is a drop-in centre that's open around the clock."
      ]
    },
    {
      "idiom": "behind the times",
      "meaning": "If someone is behind the times, they are old-fashioned and their ideas  are out of date.",
      "examples": [
        "How can we be a successful company if our executives are so behind the times that they don't know what people want these days?",
        "Neil is really behind the times. He doesn't even know what rap music sounds like!"
      ]
    },
    {
      "idiom": "day to day",
      "meaning": "If something happens day to day, it's part of your usual daily routine.",
      "examples": [
        "While you're away you'll have to pay for all your day-to-day expenses yourself, except for the hotel.",
        "She can deal with the small problems she faces day to day, but if there's a major crisis she usually panics."
      ]
    },
    {
      "idiom": "for the time being",
      "meaning": "If something will be the way it is \"for the time being\", it will be that way for a limited period of time only.",
      "examples": [
        "You can stay here for the time being, but you'll have to move out when you find your own place.",
        "My car is being repaired, so for the time being I'll have to use the bus."
      ]
    },
    {
      "idiom": "from now on",
      "meaning": "If you do something \"from now on\", you do it from now until some unknown time in the future.",
      "examples": [
        "From now on you can wear casual clothes to work every Friday.",
        "I was lucky to escape from the accident with just a few minor injuries, so from now on I'm going to be much more careful when I drive."
      ]
    },
    {
      "idiom": "from time to time",
      "meaning": "If you do something from time to time, you do it occasionally, but not very often.",
      "examples": [
        "We usually stay home on Friday nights, though from time to time we'll go to see a movie.",
        "Most of the artists we represent these days are nothing special, but from time to time we'll get one with real talent and originality."
      ]
    },
    {
      "idiom": "in the long run",
      "meaning": "If you talk about something \"in the long run\", you mean over a long period of time.",
      "examples": [
        "We might pay more now, but we'll save money in the long run because we shouldn't have to pay so much for repairs or spare parts.",
        "John says he's working so hard that he barely has time to see his family, but he says it'll be worth it in the long run. His wife isn't so sure."
      ]
    },
    {
      "idiom": "it's high time",
      "meaning": "If you say it's high time something was done, you think it should have been done already, and is overdue.",
      "examples": [
        "It's high time Mick got a real job. He's been wasting his time singing in that Rolling Stones band for too long.",
        "It's high time you started looking after your body. You're not a teenager any more, you know!"
      ]
    },
    {
      "idiom": "just in time | just in the nick of time",
      "meaning": "If you do something just in time, or just in the nick of time, you do it just before time runs out.",
      "examples": [
        "Jamie got his application form in just in time. If it had arrived a day later, it would've missed the deadline.",
        "I got to the station just in the nick of time and jumped on the train just as it was leaving."
      ]
    },
    {
      "idiom": "kill time",
      "meaning": "You kill time when you do something to amuse yourself while waiting for something.",
      "examples": [
        "I had to kill time at the airport because of the delay so I bought a book of crossword puzzles.",
        "We kill time on long trips by playing this game in which someone thinks of a country, and the next person has to think of another country that starts with the last letter of the first one, like Thailand, Denmark, Kenya, Afghanistan, Nepal, and so on."
      ]
    },
    {
      "idiom": "now and then | now and again",
      "meaning": "If you do something now and then, or now and again, you do it occasionally.",
      "examples": [
        "We usually stay home in the evenings during the week, but now and then we'll go and see a movie.",
        "Harry and Irene nearly always go to Spain or France on their holidays, but now and again they'll go somewhere different for a change."
      ]
    },
    {
      "idiom": "now or never",
      "meaning": "If you say it's now or never, you mean that  something has to be done now or it can't be done at all.",
      "examples": [
        "The band is going to break up after this tour, so if you want to see them perform, it's now or never.",
        "It was my last day with the company, so it was now or never. I went up to Jenny and asked her out on a date."
      ]
    },
    {
      "idiom": "once in a blue moon",
      "meaning": "If something happens once in a blue moon, it happens very rarely.",
      "examples": [
        "We hardly ever go out these days, though once in a blue moon we might go and see a movie.",
        "My daughter lives in Brazil and she only comes to see us once in a blue moon; maybe every two or three years if we're lucky."
      ]
    },
    {
      "idiom": "the moment of truth",
      "meaning": "The moment of truth is a time when the truth about something is revealed, or when an important decision is made.",
      "examples": [
        "We're getting our exam results today so the moment of truth is nearly here.",
        "We've been at the tennis tournament all weekend, and now we're watching the last game in the last match, so the moment of truth is here at last."
      ]
    },
    {
      "idiom": "time after time",
      "meaning": "If you do something time after time, you do it again and again, or repeatedly.",
      "examples": [
        "We've told our son time after time to call us if he's going to be late, but he still forgets sometimes.",
        "Tiger wins major tournaments time after time. He really is a champion."
      ]
    },
    {
      "idiom": "time and time again",
      "meaning": "If you've done something time and time again, you've done it many times, or you've done it repeatedly.",
      "examples": [
        "I've told Terry time and time again not to call me before ten in the morning, but he still does it!",
        "We love that restaurant. We've been there time and time again and we still like going there."
      ]
    },
    {
      "idiom": "year dot | year one",
      "meaning": "You can say \"the year dot\", or \"the year one\", when you're talking about a very, very long time ago.",
      "examples": [
        "There have been people living in Australia since the year dot, but Europeans have only been there for about two hundred years.",
        "People have been interested in the stars and the moon since the year one."
      ]
    },
    {
      "idiom": "year in, year out",
      "meaning": "If something has happened year in, year out, it's happened every year for many years in a row.",
      "examples": [
        "Our family gets together year in, year out at Christmas time.",
        "Let's go somewhere new. We've been going to the same old places year in, year out since we were married."
      ]
    }
  ],
  "Transport": [
    {
      "idiom": "a roller coaster | a roller-coaster ride",
      "meaning": "You can say an experience is a roller coaster, or a roller-coaster ride, if it involves many emotional highs and lows, or really good times alternating with really difficult times.",
      "examples": [
        "The movie follows a young guy's emotional roller-coaster ride as he tries to come to terms with being gay in a small town in Australia.",
        "Eric writes about the roller coaster of rock and roll, with the highs of success and fame followed by the lows of drug addiction and depression."
      ]
    },
    {
      "idiom": "burn your bridges | burn your boats",
      "meaning": "You have burned your bridges, or burned your boats, if you were in a situation and you then left it after doing something that made it impossible to go back there.",
      "examples": [
        "If you insult the boss when you leave, you'll be burning your bridges and you'll never be able to go back to work there again.",
        "I knew I'd be burning my boats if I dropped out of school, but I didn't care because I was determined to be a photographer."
      ]
    },
    {
      "idiom": "cross that bridge when we come to it",
      "meaning": "You can say \"we'll cross that bridge when we come to it\" if someone mentions a problem that might occur in the future, but you want them to think about what's happening now instead.",
      "examples": [
        "Martin asked what we'd do if our new company couldn't find good staff when we needed to expand, and I said we'll cross that bridge when we come to it.",
        "Jenny worries too much about things that might happen in the future, so people are always saying \"We'll cross that bridge when we come to it\" to her."
      ]
    },
    {
      "idiom": "jump on the bandwagon",
      "meaning": "If someone jumps on the bandwagon, they join a movement or follow a fashion that has recently become popular.",
      "examples": [
        "It seems that politicians all over the world are now jumping on the \"war on terror\" bandwagon.",
        "I remember when punk became popular, lots of long-haired hippies jumped on the bandwagon and cut their hair short and wore black clothes."
      ]
    },
    {
      "idiom": "plain sailing",
      "meaning": "If something is plain sailing, it's very easy to do and there are no problems to overcome.",
      "examples": [
        "Golfer Tiger Woods hit a couple of bad shots early in his round, but it was plain sailing after that and he won the match easily.",
        "I answered the first few questions in the exam without any problems, and I knew it'd be plain sailing from then on."
      ]
    },
    {
      "idiom": "put the brakes on",
      "meaning": "If you put the brakes on something, you stop it or slow it down.",
      "examples": [
        "Many companies are putting the brakes on new investment until the economy improves.",
        "The government has to put the brakes on the water treatment project until the corruption enquiry is over."
      ]
    },
    {
      "idiom": "rock the boat",
      "meaning": "If you rock the boat, you do or say something that will upset people by changing a situation that they don't want changed.",
      "examples": [
        "Don't say anything that will rock the boat or you might lose your job.",
        "The new teachers were told not to rock the boat by saying anything that could make the students question the school rules."
      ]
    },
    {
      "idiom": "steer clear of",
      "meaning": "If you steer clear of something, you don't go near it because it could harm you or cause you a problem.",
      "examples": [
        "My doctor said I should steer clear of spicy foods until I feel better.",
        "I'd steer clear of that guy if I were you. He's a bit crazy and he's always looking for a fight with someone."
      ]
    },
    {
      "idiom": "upset the applecart",
      "meaning": "If you upset the applecart, you do something that causes trouble or upsets someone's plans.",
      "examples": [
        "The Stones upset the applecart by pulling out of the music festival. They were going to be the main act.",
        "Kelly's sister really upset the applecart when she told Kelly that she'd seen her husband waiting for someone in a hotel lobby when he was supposed to be in New York."
      ]
    },
    {
      "idiom": "zebra crossing",
      "meaning": "A zebra crossing is a pedestrian crossing that is marked on the road with painted black and white stripes.",
      "examples": [
        "Visitors to Britain are sometimes confused when they're told there's a zebra crossing up ahead. Some even expect to see a zebra walking across the road.",
        "If someone steps onto a zebra crossing, all cars must stop and wait for them to cross the road."
      ]
    }
  ],
  "Weather": [
    {
      "idiom": "(it's) raining cats and dogs",
      "meaning": "You can say \"it's raining cats and dogs\" if it's raining very hard.",
      "examples": [
        "We can't go now because it's raining cats and dogs.",
        "Why do people always use \"it's raining cats and dogs\" as an example of an idiom? No-one actually uses it any more, do they?"
      ]
    },
    {
      "idiom": "a fair-weather friend",
      "meaning": "A fair-weather friend is a person who will only be your friend when things are going well for you.",
      "examples": [
        "I had lots of friends when I was rich and successful, but when the money was gone it became clear that most were only fair-weather friends.",
        "Would she still want to know you if you were sick or in trouble, or is she just one of those fair-weather friends?"
      ]
    },
    {
      "idiom": "a ray of sunshine",
      "meaning": "Something is a ray of sunshine if it brings happiness to someone.",
      "examples": [
        "The birth of Debra's first grandchild less than a year after her husband died came as a much-needed ray of sunshine in her life.",
        "After years of struggling to get established as a writer, the publication of her first short story was a ray of sunshine for Ruth."
      ]
    },
    {
      "idiom": "have your head in the clouds",
      "meaning": "If someone has their head in the clouds, they are out of touch with the everyday world and can be unrealistic or naive as a result.",
      "examples": [
        "If you think oil companies are going to help destroy their own industry by developing alternative energy sources, you have your head in the clouds.",
        "Janette must have her head in the clouds if she thinks her insurance company is going to pay the full cost of rebuilding and refurnishing her house."
      ]
    },
    {
      "idiom": "make hay while the sun shines",
      "meaning": "If you make hay while the sun shines, you make good use of the chance to do something while it lasts.",
      "examples": [
        "We've got a few days off work so lets make hay while the sun shines and do some landscaping around the back of the house.",
        "Jim works too much, but he reckons he's just making hay while the sun shines. He says he'll slow down once he's made his fortune."
      ]
    },
    {
      "idiom": "quick as a flash | quick as a wink | quick as lightning",
      "meaning": "If you're as quick as a flash, or quick as a wink, or quick as lightning, you're very quick.",
      "examples": [
        "Jimmy knew the answer and, quick as a flash, he put up his hand.",
        "Rafael is a big guy for a tennis player, but he's as quick as lightning when he's running around the court."
      ]
    },
    {
      "idiom": "snowed under",
      "meaning": "If you are snowed under you have so much to do that you're having trouble doing it all.",
      "examples": [
        "I was so snowed under with work today that I didn't even have time for lunch.",
        "If I don't deal with these orders they'll build up and I'll soon be snowed under again."
      ]
    },
    {
      "idiom": "under a cloud",
      "meaning": "If someone is under a cloud, they are suspected of having done something wrong.",
      "examples": [
        "Ever since the rumours of corruption started, the president has been under a cloud and he probably won't win another election.",
        "Henry has been under a cloud since the money disappeared and he bought a new car."
      ]
    },
    {
      "idiom": "under the weather",
      "meaning": "If you are under the weather, you're not feeling well.",
      "examples": [
        "Hiroko's feeling a bit under the weather. He thinks he might have the flu.",
        "Sorry, but I don't think I'll be able to make it to work today. I'm feeling a bit under the weather."
      ]
    },
    {
      "idiom": "weather a storm",
      "meaning": "If you weather a storm, you survive a dangerous event or deal with a difficult situation.",
      "examples": [
        "Everyone waited to see if the president could weather the storm caused by his son's arrest for using illegal drugs.",
        "Poor Mandy had to stand there and weather the storm as her boss shouted insults at her for letting him forget something."
      ]
    }
  ],
  "American": [
    {
      "idiom": "a ballpark figure | a ballpark estimate",
      "meaning": "If you give a ballpark figure or a ballpark estimate, you give a number which you think is fairly close to the actual one.",
      "examples": [
        "We don't know the exact cost, but a ballpark figure would be around six million dollars.",
        "I know you can't tell me exactly when it'll be finished, but can you give me a ballpark estimate?"
      ]
    },
    {
      "idiom": "a done deal",
      "meaning": "A done deal is an agreement or a decision that is final.",
      "examples": [
        "It's a done deal so we can go ahead and start planning the details.",
        "No-one knew about it, but the contract has been a done deal since the senator spoke to the minister last month."
      ]
    },
    {
      "idiom": "a drop in the bucket",
      "meaning": "If an amount is a drop in the bucket, it's a very small portion of the amount that's needed.",
      "examples": [
        "Our government's sending a thousand tons of food, but that's just a drop in the bucket compared to what's needed.",
        "I know twenty dollars is just a drop in the bucket, but if everyone gave that much it'd make a big difference."
      ]
    },
    {
      "idiom": "a new lease on life",
      "meaning": "If someone has a new lease on life, they have a new enthusiasm for living.",
      "examples": [
        "After recovering from her illness, Kathy had a new lease on life and made lots of plans for the future.",
        "When my uncle quit drinking it gave him a new lease on life and he started doing things he hadn't done for years."
      ]
    },
    {
      "idiom": "a quick study",
      "meaning": "If you're a quick study, you can learn new things quickly.",
      "examples": [
        "Albert was always a quick study, except when it came to learning languages.",
        "I only need to show Sue how to do something once, and she gets it. She's a quick study, that girl."
      ]
    },
    {
      "idiom": "an ax to grind (1)",
      "meaning": "If you have an ax to grind with someone, you have a problem with them, or a complaint against them, which you'd like to discuss.",
      "examples": [
        "I have an ax to grind with Mitch. He owes me money and he's been avoiding me.",
        "If Larry has an ax to grind with someone, and he meets them after he's been drinking, he can get violent."
      ]
    },
    {
      "idiom": "an even break",
      "meaning": "If you get an even break, you get a fair opportunity to succeed in your ambition or to achieve your goals.",
      "examples": [
        "All Monica needs is an even break and she could be one of the country's top models.",
        "He says he's never had an even break in life and that's why he's never achieved much."
      ]
    },
    {
      "idiom": "at loose ends",
      "meaning": "If you're at loose ends, you feel restless and unsettled because you don't have anything to do.",
      "examples": [
        "Hank's been at loose ends since he lost his job, so I hope he finds another one soon.",
        "We tried limiting the time Jimmy could play computer games, but he gets restless and moody whenever he's at loose ends, so we let him play."
      ]
    },
    {
      "idiom": "beat the rap",
      "meaning": "If someone beats the rap, they avoid being found guilty of a crime.",
      "examples": [
        "Everyone knows that Jimmy the Snitch did the robbery in Green St., but he beat the rap because he's in with the cops.",
        "Henry was charged with drunk driving, but his lawyer helped him beat the rap on some technical detail."
      ]
    },
    {
      "idiom": "behind the eight ball",
      "meaning": "If you're behind the eight ball, you're in a difficult or dangerous position.",
      "examples": [
        "The economic recession has really put our new business behind the eight ball. Nobody's spending money.",
        "Carlo is behind the eight ball now because his final exam is in two days and he still hasn't started studying for it."
      ]
    },
    {
      "idiom": "can't see the forest for the trees",
      "meaning": "If you can't see the forest for the trees, you can't see the whole situation clearly because you're looking too closely at small details, or because you're too closely involved.",
      "examples": [
        "I don't think we can see the forest for the trees at this stage, so let's get an outsider to take a look at the project and give us a progress report.",
        "Mark is so focused on product details that he can't see the forest for the trees when it comes to the overall needs of the company."
      ]
    },
    {
      "idiom": "going down",
      "meaning": "If you know what's going down, you know what's happening in a situation.",
      "examples": [
        "If you need someone who knows what's going down in the world of youth fashion, you need a young person, not a middle-aged executive.",
        "A young guy ran over and said, \"You know what's going down? I heard some gunshots and just now I saw these guys running from over that way.\""
      ]
    },
    {
      "idiom": "hit the hay | hit the sack",
      "meaning": "If you hit the hay, or hit the sack, you go to bed.",
      "examples": [
        "It's after midnight so it's time I hit the hay.",
        "You look really tired. What time did you hit the sack last night?"
      ]
    },
    {
      "idiom": "jockey for position",
      "meaning": "If you jockey for position, you try to get yourself in a good position in relation to others who're competing for the same opportunity or the same goal.",
      "examples": [
        "Several of us are jockeying for position as we negotiate with the manager for the job of running the new branch office.",
        "Four candidates will jockey for position in the run-up to the Democratic convention next month."
      ]
    },
    {
      "idiom": "keep up with the Joneses",
      "meaning": "People who try to keep up with the Joneses are people who feel it's important to show that they're as successful as others (such as their rich neighbours, \"The Joneses\").",
      "examples": [
        "I'm surprised that Miriam worries about keeping up with the Joneses. I thought she was more mature than that.",
        "My grandma said, \"Forget about keeping up with the Joneses. The people who matter in your life will respect and love you because of who you are, not because of what you've got or what sort of car you drive.\""
      ]
    },
    {
      "idiom": "leave well enough alone | let well enough alone",
      "meaning": "If you leave well enough alone, or let well enough alone, you don't try to improve or change something that's already good enough.",
      "examples": [
        "The kids seem happy enough now so let's just leave well enough alone and forget about finding a new school for them.",
        "Unless there's a problem, I'd suggest you just let well enough alone and let your staff get on with their work."
      ]
    },
    {
      "idiom": "No way!",
      "meaning": "You can say \"No way!\" when you want to strongly reject an offer, a request, or a suggestion.",
      "examples": [
        "Hassan's father said he should sell his car to pay off his debts, but Hassan looked shocked at the suggestion and just said, \"No way!\"",
        "I love this job and there's no way I'd quit just to make a bit more money."
      ]
    },
    {
      "idiom": "right down your alley | right up your alley",
      "meaning": "If something is right down your alley, or right up your alley, it would be perfect for you or ideal for your skills and interests.",
      "examples": [
        "I've found a job that should be right down Lou's alley. It's writing for a baseball magazine, so he could use his writing skills and his knowledge of baseball.",
        "I thought a tour of Aztec archeological sites would be right up your alley, Mary-Lou."
      ]
    },
    {
      "idiom": "the new kid on the block",
      "meaning": "If you are the new kid on the block, you are the newest person in a workplace or in an educational institute, or any other place or organization.",
      "examples": [
        "Have you met Brigette? She's the new kid on the block - just started working here today.",
        "Paula hates being the new kid on the block. She finds meeting lots of new people stressful, and she gets nervous when she thinks that everyone is looking at her and trying to decide if they like her."
      ]
    },
    {
      "idiom": "under the table",
      "meaning": "If something is done under the table, it's done secretly, usually because it's illegal or unethical.",
      "examples": [
        "If I do any overtime, can you pay me under the table so I won't have pay tax on it.",
        "If you make under-the-table payments to customs officials, you can get goods through the port without having them inspected."
      ]
    },
    {
      "idiom": "yellow journalism",
      "meaning": "Journalism in which sensational stories are used to boost sales, or biased reporting is used to change the reader's views on an issue. Both of these are unethical.",
      "examples": [
        "Have you noticed how, during a war, normally trustworthy professionals start writing the worst sort of yellow journalism to justify their government's actions?",
        "Joe: \"Is there any difference between yellow journalism and propaganda?\" Kate: \"I think yellow journalism can be even more dangerous than propaganda if it's  being presented as objective reporting by well-known journalists.\""
      ]
    },
    {
      "idiom": "zero tolerance",
      "meaning": "If something is given zero tolerance, it won't be accepted even once.",
      "examples": [
        "Because of the school's zero-tolerance policy, our boy was expelled for smoking just one cigarette.",
        "How can a society based on Christian morals and forgiveness of sin have a zero-tolerance approach to petty crime?"
      ]
    },
    {
      "idiom": "zero-sum game",
      "meaning": "A zero-sum game is a situation in which any gain by one side or person  is at the expense of a loss to another side or person involved in the situation.",
      "examples": [
        "The stock market has become a giant zero-sum game in which one investor gains what another investor loses.",
        "In a zero-sum game, if you add the total gains of the participants and the total losses of the participants, the sum will always be zero."
      ]
    }
  ],
  "Australian": [
    {
      "idiom": "up a gum tree",
      "meaning": "If you're up a gum tree, you're in trouble or have a serious problem.",
      "examples": [
        "The company is up a gum tree because they broke some laws about polluting the environment, and they'll probably get closed down.",
        "My mate Bruce is up a gum tree. He got a sheila up the duff and now she's twisting his arm to get hitched. (see Note 2 below)"
      ]
    }
  ],
  "British": [
    {
      "idiom": "a drop in the ocean",
      "meaning": "If an amount is a drop in the ocean, it's a very small portion of the amount that's needed.",
      "examples": [
        "Our government's sending a thousand tons of food, but that's just a drop in the ocean compared to what's needed.",
        "I know twenty dollars is just a drop in the ocean, but if everyone gave that much it'd make a big difference."
      ]
    },
    {
      "idiom": "a new lease of life",
      "meaning": "If someone has a new lease of life, they have a new enthusiasm for living.",
      "examples": [
        "After recovering from her illness, Kathy had a new lease of life and made lots of plans for the future.",
        "When my uncle quit drinking it gave him a new lease of life and he started doing things he hadn't done for years."
      ]
    },
    {
      "idiom": "a piece of cake",
      "meaning": "If you say that something is a piece of cake, you mean that it is extremely easy.",
      "examples": [
        "I finished my exam 30 minutes early. It was a piece of cake!",
        "Compared to learning Japanese, learning Indonesian was a piece of cake. It's a much simpler language."
      ]
    },
    {
      "idiom": "an axe to grind (2)",
      "meaning": "If you have an axe to grind, you have a strong opinion about something and you express this opinion whenever you can.",
      "examples": [
        "Billy's had this axe to grind about globalisation recently and he's always going on about it.",
        "These people always seem to have an axe to grind and whenever someone interviews them they see it as a chance to push their ideas."
      ]
    },
    {
      "idiom": "another string to your bow",
      "meaning": "If you have another string to your bow, you have another way of making a living.",
      "examples": [
        "Lots of people learn to teach English so they'll have another string to their bow.",
        "I've lost my job and I'll have to retrain for something else. I wish I already had another string to my bow."
      ]
    },
    {
      "idiom": "at a loose end",
      "meaning": "If you're at a loose end, you have nothing to do.",
      "examples": [
        "If I'm ever at a loose end, I look for a good book to read.",
        "Give me a call if you're at a loose end and we'll go and do something."
      ]
    },
    {
      "idiom": "can't see the wood for the trees",
      "meaning": "If you can't see the wood for the trees, you can't see the whole situation clearly because you're looking too closely at small details, or because you're too closely involved.",
      "examples": [
        "I don't think we can see the wood for the trees at this stage, so let's get an outsider to take a look at the project and give us a progress report.",
        "Marcus is so focused on product details that he can't see the wood for the trees when it comes to the overall needs of the company."
      ]
    },
    {
      "idiom": "come a cropper",
      "meaning": "If you come a cropper, you fall over, or you make a mistake which has serious consequences for you.",
      "examples": [
        "The prime minister came a cropper while coming down the steps and hurt his backside.",
        "A radio announcer really came a cropper when he made a racist remark. He lost his job and now he can't get another one."
      ]
    },
    {
      "idiom": "come up trumps",
      "meaning": "If you come up trumps, you succeed in something that you may not have been expected to succeed in.",
      "examples": [
        "Nicole came up trumps, winning her match despite her injured knee.",
        "John's dad was sure his son would came up trumps, and he did."
      ]
    },
    {
      "idiom": "eat humble pie",
      "meaning": "If you eat humble pie, you admit that you are in the wrong and behave apologetically.",
      "examples": [
        "Jim had to eat humble pie after we proved that what he'd said was wrong.",
        "Some politicians are so arrogant that they won't eat humble pie even when it's clear they've made a mistake. They just say they were \"misinformed\"."
      ]
    },
    {
      "idiom": "go down a treat",
      "meaning": "If something goes down a treat, it's a great success and everyone enjoys it.",
      "examples": [
        "The speech Lenny made at his daughter's wedding went down a treat. Everyone thought it was very funny but also very moving.",
        "Geraldine made some pancakes for breakfast and they went down a treat. They were really delicious."
      ]
    },
    {
      "idiom": "itchy feet",
      "meaning": "If you have itchy feet, you feel the need to go somewhere different or do something different.",
      "examples": [
        "It's no wonder Ken's got itchy feet. He's been doing the same job, in the same office, for nearly twenty years.",
        "Thanks to low-cost airlines, people with itchy feet who couldn't afford air fares in the past can now travel."
      ]
    },
    {
      "idiom": "jobs for the boys",
      "meaning": "If you say \"jobs for the boys\" you're referring to  the fact that people in positions of power sometimes use their power to give jobs to their friends or family members.",
      "examples": [
        "Henry deserved the position, but it was a case of jobs for the boys, as usual, and one of the boss's old school friends got it instead of Henry.",
        "The new government has promised to stop the old system of jobs for the boys when it comes to appointing departmental heads."
      ]
    },
    {
      "idiom": "just the ticket",
      "meaning": "You can say something is just the ticket if it's the perfect thing or if it's exactly what's needed.",
      "examples": [
        "That's just the ticket! Edna loves brooches, especially if they have bird designs, so she'll absolutely love this one.",
        "As soon as he saw the painting, grandpa said, \"That one's just the ticket. It'll look lovely over the fireplace.\""
      ]
    },
    {
      "idiom": "make a song and dance about something",
      "meaning": "If you make a song and dance about something, you make a big deal out of, or a fuss over, something that isn't very important.",
      "examples": [
        "Why are people making such a song and dance about the fact that the health minister used to smoke cigarettes? You'd think he'd worshipped the devil from the way they're carrying on about it!",
        "Carol thinks people should be angry about the injustices in the world, but instead they make a song and dance about things like the high price of bananas."
      ]
    },
    {
      "idiom": "off your own bat",
      "meaning": "If you do something off your own bat, you do it without being asked to or told to.",
      "examples": [
        "I didn't tell the gardener to cut down the tree. He did it off his own bat.",
        "One of the actresses decided, off her own bat, to change her lines in the movie. The director wasn't happy."
      ]
    },
    {
      "idiom": "right up your street",
      "meaning": "If something is right up your street, it would be perfect for you or ideal for your skills and interests.",
      "examples": [
        "I've found a job that should be right up Humphrey's street. It's writing for a cricket magazine, so he could use his writing skills and his knowledge of cricket.",
        "I thought a tour of German castles would be right up your street, Sarah."
      ]
    },
    {
      "idiom": "take the mickey | mick out of someone",
      "meaning": "If you're taking the mickey out of someone, or taking the mick out of them, you're making fun of them or copying their behaviour for a laugh.",
      "examples": [
        "When I moved to the U.S., I upset a few people by taking the mickey out of them. They didn't understand that it was just for fun, and I wasn't being mean to them.",
        "Taking the mick out of someone can help them to learn how not to take themselves too seriously."
      ]
    },
    {
      "idiom": "um and ah",
      "meaning": "If you \"um and ah\" you're having trouble deciding what to say, or you're having trouble telling somebody something.",
      "examples": [
        "Stop umming and ahing and just tell me what happened!",
        "James ummed and ahed for a while, but he eventually agreed to help us get the deal."
      ]
    },
    {
      "idiom": "zebra crossing",
      "meaning": "A zebra crossing is a pedestrian crossing that is marked on the road with painted black and white stripes.",
      "examples": [
        "Visitors to Britain are sometimes confused when they're told there's a zebra crossing up ahead. Some even expect to see a zebra walking across the road.",
        "If someone steps onto a zebra crossing, all cars must stop and wait for them to cross the road."
      ]
    }
  ]
}