{
  "Climate Change": [
    {
      "phrasal_verb": "heat up",
      "definition": "increase in temperature",
      "examples": [
        "The planet is heating up due to a high level of CO2 in the atmosphere.",
        "If you put food in the microwave, it heats up."
      ]
    },
    {
      "phrasal_verb": "rely on (something)",
      "definition": "depend on something; need something for another thing to function",
      "examples": [
        "Humans rely on fossil fuels to heat our homes and fuel our cars.",
        "When I broke my ankle, I relied on my family to help me around the house."
      ]
    },
    {
      "phrasal_verb": "dry up",
      "definition": "lose liquid and become dry",
      "examples": [
        "This valley used to be a lake but it dried up centuries ago.",
        "The juice you spilled on the floor has finally dried up."
      ]
    },
    {
      "phrasal_verb": "die out",
      "definition": "gradually become extinct e.g. species",
      "examples": [
        "If we don't protect their habitats, many species will die out before the end of the century.",
        "Some traditional skills are dying out in modern society."
      ]
    },
    {
      "phrasal_verb": "wipe (something) out",
      "definition": "eliminate something, e.g. a species, in a sudden and destructive way",
      "examples": [
        "Pollution and deforestation have wiped out entire ecosystems.",
        "The hurricane wiped out the entire neighbourhood, leaving only destruction and debris."
      ]
    },
    {
      "phrasal_verb": "cut down on (something)",
      "definition": "use or do less of something",
      "examples": [
        "One way to combat climate change is to cut down on our use of fossil fuels.",
        "I'm going to start cutting down on sugar to improve my health."
      ]
    },
    {
      "phrasal_verb": "fight for (something) push for (something)",
      "definition": "try really hard to achieve something or make it happen",
      "examples": [
        "The community is fighting for cleaner air and water in their neighbourhood.",
        "The workers are pushing for higher wages and better conditions."
      ]
    },
    {
      "phrasal_verb": "take part in (something)",
      "definition": "participate in an activity or event",
      "examples": [
        "I took part in a beach clean-up event and together we removed 200 bags of rubbish.",
        "Every year, we take part in a fundraising challenge to raise money for sustainability projects."
      ]
    }
  ],
  "Eating": [
    {
      "phrasal_verb": "snack on (something)",
      "definition": "eat small amounts of something casually, between meals",
      "examples": [
        "She likes to snack on almonds while she works.",
        "The kids were snacking on biscuits while watching the film."
      ]
    },
    {
      "phrasal_verb": "munch on (something)",
      "definition": "eat something casually, usually in a way that makes a crunching sound",
      "examples": [
        "He's munching on his apple.",
        "They munched on popcorn at the cinema."
      ]
    },
    {
      "phrasal_verb": "dig in or tuck in (to something)",
      "definition": "start eating excitedly or enthusiastically. Often used to give people permission to start eating",
      "examples": [
        "The food looks delicious — let’s dig in!",
        "The children tucked into their pancakes with delight."
      ]
    },
    {
      "phrasal_verb": "eat up or eat (something) up",
      "definition": "finish all the food on your plate. Often used as an imperative",
      "examples": [
        "Eat up! You've got a big day tomorrow — you'll need the energy!",
        "You’d better eat up all your vegetables before you leave the table!"
      ]
    },
    {
      "phrasal_verb": "pig out",
      "definition": "eat a lot of food in a greedy way, often more than you need",
      "examples": [
        "After the long hike, she pigged out on sugary doughnuts.",
        "We usually pig out on snacks when we have movie nights."
      ]
    },
    {
      "phrasal_verb": "eat out",
      "definition": "eat somewhere outside of the home, like a restaurant or cafe",
      "examples": [
        "I love eating out, but it can be expensive if you do it all the time.",
        "We've got no food in the house, so why don't we eat out this evening?"
      ]
    }
  ],
  "Work": [
    {
      "phrasal_verb": "take (something) on",
      "definition": "accept responsibility for a task or project, often in addition to one's usual duties.",
      "examples": [
        "She decided to take on a new project at work, even though she was already busy.",
        "He’s always willing to take on extra tasks to help the team."
      ]
    },
    {
      "phrasal_verb": "come up with (something)",
      "definition": "think of or create an idea, solution, or plan.",
      "examples": [
        "She came up with a brilliant marketing strategy that boosted sales.",
        "We need to come up with a new approach to meet the deadline."
      ]
    },
    {
      "phrasal_verb": "put (something) in",
      "definition": "contribute something to achieve a goal",
      "examples": [
        "He’s been putting in a lot of effort to improve his performance at work.",
        "They put in long days and weekends to complete the project before the deadline."
      ]
    },
    {
      "phrasal_verb": "knuckle down",
      "definition": "start working very hard, especially after a period of not doing much.",
      "examples": [
        "Let’s get rid of all the distractions and knuckle down so I can get this project done.",
        "The team needs to knuckle down and focus if they want to finish the project on time."
      ]
    },
    {
      "phrasal_verb": "get ahead",
      "definition": "make progress and move past others, or complete your tasks earlier than expected",
      "examples": [
        "She worked hard to get ahead in her career and eventually became a manager.",
        "In order to get ahead in this company, you need to be proactive and take initiative."
      ]
    },
    {
      "phrasal_verb": "look into (something)",
      "definition": "investigate, or get information before you take action",
      "examples": [
        "The HR department is looking into the complaints made by the employees.",
        "We need to look into new software options to improve our workflow."
      ]
    },
    {
      "phrasal_verb": "get back to (someone)",
      "definition": "speak to someone again later to give them a reply after you've looked into something",
      "examples": [
        "I’ll get back to you with more information after I discuss it with the team.",
        "Can you get back to the client about their inquiry as soon as possible?"
      ]
    }
  ],
  "Sleep": [
    {
      "phrasal_verb": "lie down",
      "definition": "put yourself in a flat, usually horizontal position",
      "examples": [
        "He lay down on the sofa to watch some TV and ended up falling asleep.",
        "The doctor asked him to lie down while she examined him."
      ]
    },
    {
      "phrasal_verb": "stay up",
      "definition": "continue to stay awake longer than you would usually",
      "examples": [
        "We stayed up late watching movies until 2am.",
        "The kids wanted to stay up past their bedtime to see the fireworks."
      ]
    },
    {
      "phrasal_verb": "doze/nod off",
      "definition": "go to sleep slowly and gradually, often without intending to and often during the day",
      "examples": [
        "He dozed off during the lecture because he was so tired.",
        "It doesn't matter how interested Dad is in the film, he always nods off."
      ]
    },
    {
      "phrasal_verb": "crash out",
      "definition": "fall asleep rapidly because you're very tired",
      "examples": [
        "After the long hike, everyone crashed out as soon as they got back to the cabin.",
        "We crashed out at a friend's place after the party because we were too tired to drive home."
      ]
    },
    {
      "phrasal_verb": "sleep through (something)",
      "definition": "sleep and not be woken up by a loud noise or some kind of disturbance",
      "examples": [
        "She slept through her alarm and was consequently late for work.",
        "He slept through the thunderstorm and didn’t wake up until morning."
      ]
    },
    {
      "phrasal_verb": "sleep on (something)",
      "definition": "think about something while sleeping before making a decision",
      "examples": [
        "I’m not sure about the offer. I’ll sleep on it and give you an answer tomorrow.",
        "Before making any decisions, it’s always good to sleep on it and think it over."
      ]
    }
  ],
  "Feelings": [
    {
      "phrasal_verb": "bottle up (feelings/emotions)",
      "definition": "keep feelings hidden and suppressed instead of talking about them",
      "examples": [
        "He tends to bottle up his anger, which often leads to stress.",
        "Don’t bottle up your emotions; it’s important to talk about how you feel."
      ]
    },
    {
      "phrasal_verb": "open up",
      "definition": "share your feelings freely and openly",
      "examples": [
        "After years of keeping everything inside, she finally opened up to her therapist.",
        "He finds it hard to open up about his past, even to close friends."
      ]
    },
    {
      "phrasal_verb": "hold back/hold (something) back",
      "definition": "hesitate or restrain oneself from saying or doing something",
      "examples": [
        "He wanted to tell her the truth, but he decided to hold back.",
        "She had to hold back her tears during the emotional movie.",
        "I tried to hold back my laughter during the meeting, but it was impossible."
      ]
    },
    {
      "phrasal_verb": "break down",
      "definition": "lose control of your emotions and start crying",
      "examples": [
        "After weeks of stress, he finally broke down and cried.",
        "She broke down in tears when she heard the sad news."
      ]
    },
    {
      "phrasal_verb": "blow up",
      "definition": "lose emotional control in an angry way",
      "examples": [
        "He blew up at his work colleague for making the same mistake again.",
        "The teacher blew up when the students wouldn’t stop talking."
      ]
    },
    {
      "phrasal_verb": "freak out",
      "definition": "lose emotional control (from shock, excitement, fear etc.)",
      "examples": [
        "Don’t freak out, but there’s a spider on your shoulder!",
        "She freaked out when she saw her favourite popstar on the street."
      ]
    },
    {
      "phrasal_verb": "calm down",
      "definition": "return to a state of calmness or relaxation after feeling intense emotions",
      "examples": [
        "After taking a few deep breaths, I started to calm down.",
        "He needed a few minutes to calm down after the argument."
      ]
    }
  ],
  "Travel": [
    {
      "phrasal_verb": "look forward to (something)",
      "definition": "anticipate something good or exciting happening in the future",
      "examples": [
        "He’s really looking forward to his summer holiday by the beach.",
        "My parents are really looking forward to their book club event this weekend."
      ]
    },
    {
      "phrasal_verb": "get away",
      "definition": "escape from your usual responsibilities and go on holiday",
      "examples": [
        "I’m feeling burnt out. I’d love to get away for a few days and spend time in the countryside.",
        "We've had a hard year. Let's get away at some point in the winter months."
      ]
    },
    {
      "phrasal_verb": "pick (someone) up",
      "definition": "collect someone and take them to another location, usually in a vehicle like a car",
      "examples": [
        "The taxi picked the woman up from her house and took her to the airport.",
        "The bus picks us up every morning and takes us to school."
      ]
    },
    {
      "phrasal_verb": "hurry up",
      "definition": "go faster",
      "examples": [
        "Hurry up! We’re going to miss our flight!",
        "We really need to hurry up if we want to catch the train."
      ]
    },
    {
      "phrasal_verb": "get in/out",
      "definition": "enter/exit a vehicle with a small space (car, taxi, truck, lorry, van, helicopter), and immediately sit down",
      "examples": [
        "I got in the car and then started driving.",
        "Once they arrived, they got out the taxi and walked into the airport."
      ]
    },
    {
      "phrasal_verb": "get on/off",
      "definition": "enter/exit a vehical standing on your feet (bus, plane, train, tram, boat)",
      "examples": [
        "We're at our stop - let's get off the bus.",
        "After she got on the bus, she realised it was the wrong one."
      ]
    },
    {
      "phrasal_verb": "set off",
      "definition": "Begin your journey",
      "examples": [
        "Grandpa set off at 6am to make sure he arrived at the airport early for his flight.",
        "Once we had prepared the picnic food, we set off towards the park."
      ]
    }
  ],
  "Technology": [
    {
      "phrasal_verb": "log/sign in",
      "definition": "enter your username and password to access a computer system",
      "examples": [
        "I can't log in because I'm struggling to remember my password!"
      ]
    },
    {
      "phrasal_verb": "log/sign out",
      "definition": "to exit or end your computer session",
      "examples": [
        "Remember to log out of your online banking after use so no one else can access your details."
      ]
    },
    {
      "phrasal_verb": "sign up",
      "definition": "register or create an account for a service or website",
      "examples": [
        "If you want to be the first to hear about concert tickets, sign up to the mailing list."
      ]
    },
    {
      "phrasal_verb": "scroll through",
      "definition": "move through information or images on a screen with a dragging or swiping motion",
      "examples": [
        "I want to read more books, but first I need to break the habit of scrolling through social media whenever I'm bored."
      ]
    },
    {
      "phrasal_verb": "turn/switch (something) on",
      "definition": "give power to, or activate a device or system",
      "examples": [
        "I was bored, so I turned the TV on and started watching."
      ]
    },
    {
      "phrasal_verb": "turn/switch (something) off",
      "definition": "stop the power of a device or system",
      "examples": [
        "Remember to turn off your computer before you leave the office."
      ]
    },
    {
      "phrasal_verb": "turn (something) up",
      "definition": "increase the volume or intensity of something",
      "examples": [
        "I can't hear the TV - can you turn it up?"
      ]
    }
  ],
  "Health & Fitness": [
    {
      "phrasal_verb": "warm up",
      "definition": "do light exercise or stretches to prepare the body for the main workout",
      "examples": [
        "Let's warm up before the race by doing a light jog around the field."
      ]
    },
    {
      "phrasal_verb": "work out",
      "definition": "train your body through exercise",
      "examples": [
        "I try to work out at least twice a week. It helps to relieve stress."
      ]
    },
    {
      "phrasal_verb": "cool down",
      "definition": "do light exercise or stretches after the main workout to help your muscles recover",
      "examples": [
        "After running, I cool down by walking for five minutes, then stretching."
      ]
    },
    {
      "phrasal_verb": "stick to (something)",
      "definition": "continue doing something consistently, even if it's difficult",
      "examples": [
        "I'm really proud of my daughter for sticking to her football training programme."
      ]
    },
    {
      "phrasal_verb": "give up",
      "definition": "stop doing something and accept defeat",
      "examples": [
        "After six attempts at jumping two metres and failing, she gave up."
      ]
    },
    {
      "phrasal_verb": "give (something) up",
      "definition": "stop doing or consuming something that's bad for you",
      "examples": [
        "I've given up ordering takeaway pizzas because I want to eat more healthily."
      ]
    },
    {
      "phrasal_verb": "cut down (on)",
      "definition": "reduce how much you do or consume something",
      "examples": [
        "I really need to cut down on sugary snacks after meals if I want to feel healthier."
      ]
    },
    {
      "phrasal_verb": "cut (something) out",
      "definition": "eliminate something from your life completely",
      "examples": [
        "Lifting weights was giving me neck pain, so I've cut that out of my workout routine."
      ]
    }
  ],
  "Money": [
    {
      "phrasal_verb": "fork out",
      "definition": "spend a lot reluctantly",
      "examples": [
        "I forked out a large part of my savings for my cat's medical bills this month."
      ]
    },
    {
      "phrasal_verb": "splash out (on)",
      "definition": "spend a lot enthusiastically",
      "examples": [
        "After our wedding, we splashed out on a safari in South Africa for our honeymoon."
      ]
    },
    {
      "phrasal_verb": "pay (someone) back",
      "definition": "return money that you borrowed from someone",
      "examples": [
        "My dream is to pay my parents back for all the money they spent on my education."
      ]
    },
    {
      "phrasal_verb": "run out of",
      "definition": "spend all your money, leaving nothing left",
      "examples": [
        "Unfortunately, we ran out of money before we finished building the shed, and we couldn't pay for more materials."
      ]
    },
    {
      "phrasal_verb": "live on",
      "definition": "have a particular amount of money that you use to buy the essentials",
      "examples": [
        "Since retiring, my grandparents are able to live on their state pensions."
      ]
    },
    {
      "phrasal_verb": "get by",
      "definition": "live with difficulty with the money you have",
      "examples": [
        "I get by with my salary, but I don't have enough to save up or treat myself to luxuries."
      ]
    },
    {
      "phrasal_verb": "save up",
      "definition": "accumulate your money by not spending it, usually for a purpose",
      "examples": [
        "My sister is saving up to buy a house."
      ]
    }
  ],
  "Education": [
    {
      "phrasal_verb": "be into (something)",
      "definition": "have an interest in something",
      "examples": [
        "Many teenagers nowadays are into gaming and spend hours playing with friends."
      ]
    },
    {
      "phrasal_verb": "take (something) up",
      "definition": "start participating in an activity",
      "examples": [
        "During retirement, Mr Johnson took up gardening to stay active and spend time outdoors."
      ]
    },
    {
      "phrasal_verb": "read up on (something)",
      "definition": "learn about something through reading",
      "examples": [
        "Before starting his business, Jack spent weeks reading up on entrepreneurship."
      ]
    },
    {
      "phrasal_verb": "brush up on (something)",
      "definition": "improve your existing skills that may be a bit weak",
      "examples": [
        "Mark did a refresher course to brush up on his accounting skills before starting his new job."
      ]
    },
    {
      "phrasal_verb": "work on (something)",
      "definition": "put effort and concentration into doing something",
      "examples": [
        "She needs to work on her time management so she can meet deadlines more easily."
      ]
    },
    {
      "phrasal_verb": "fall behind",
      "definition": "progress more slowly than others doing the same activity",
      "examples": [
        "Because of her illness, Sarah fell behind in her coursework."
      ]
    },
    {
      "phrasal_verb": "catch up (on something)",
      "definition": "spend extra time doing something because you did not do it earlier",
      "examples": [
        "Once Sarah recovered from her illness, she took some time to catch up on her coursework."
      ]
    },
    {
      "phrasal_verb": "hand (something) in",
      "definition": "give a finished project to the person or people who need to see it",
      "examples": [
        "Once Sarah had caught up on her coursework, she handed it in to her teacher."
      ]
    }
  ],
  "Friendship": [
    {
      "phrasal_verb": "get on (with someone)",
      "definition": "like someone and have a friendly relationship with them",
      "examples": [
        "My sister and I really get on. We have a lot of fun together!",
        "Arturo gets on with his colleagues. They have similar personalities."
      ]
    },
    {
      "phrasal_verb": "fall out (with someone)",
      "definition": "stop being friends with someone after an argument",
      "examples": [
        "Mia and Nathan fell out after Mia lied and didn’t apologise.",
        "Jake fell out with his roommate about household responsibilities."
      ]
    },
    {
      "phrasal_verb": "run into (someone)",
      "definition": "meet someone unexpectedly",
      "examples": [
        "Fatima ran into her neighbour at the supermarket.",
        "Two childhood friends ran into each other in a London coffee shop."
      ]
    },
    {
      "phrasal_verb": "hear from (someone)",
      "definition": "receive communication from someone, e.g. via phone, email or letter",
      "examples": [
        "I was thrilled to hear from my long-lost friend after years of being out of touch.",
        "Do you know how Uncle Jim is? I haven’t heard from him in a while."
      ]
    },
    {
      "phrasal_verb": "make up (with someone)",
      "definition": "become friends with someone again after having an argument",
      "examples": [
        "It took time, but eventually the siblings made up and repaired their relationship.",
        "We’re all waiting for you and Charlie to make up. It would be a shame to lose the friendship."
      ]
    },
    {
      "phrasal_verb": "hang out (with someone)",
      "definition": "spend time relaxing or socialising with someone",
      "examples": [
        "At the weekend, my friends and I hang out at the local coffee shop.",
        "I love hanging out with my younger cousins – they’re so funny!"
      ]
    },
    {
      "phrasal_verb": "catch up (with someone)",
      "definition": "talk to someone about what’s been happening in your lives since the last time you spoke",
      "examples": [
        "Family reunions are a great time to catch up with relatives you don’t see often.",
        "I caught up with Lina last week – so much has happened since I last saw her!"
      ]
    }
  ],
  "Housework": [
    {
      "phrasal_verb": "turn (something) on",
      "definition": "give power to something electrical or mechanical, like a light, a TV, or a tap",
      "examples": [
        "The first thing I do in the morning is turn on the coffee machine."
      ]
    },
    {
      "phrasal_verb": "pick (something) up",
      "definition": "grab something and lift it",
      "examples": [
        "He reached down to pick up his keys that he dropped on the floor."
      ]
    },
    {
      "phrasal_verb": "clean up",
      "definition": "make something clean",
      "examples": [
        "The house was a mess after the party, but everyone helped to clean up."
      ]
    },
    {
      "phrasal_verb": "throw (something) away",
      "definition": "dispose of or discard something that you don’t want",
      "examples": [
        "He decided to throw away his old magazine collection after they got wet."
      ]
    },
    {
      "phrasal_verb": "wash up",
      "definition": "clean anything you’ve used while preparing food (British English)",
      "examples": [
        "If I cook, will you wash up the dishes?"
      ]
    },
    {
      "phrasal_verb": "put (something) away",
      "definition": "place something in its original place after using it",
      "examples": [
        "The students were told to put their textbooks away before the next activity."
      ]
    },
    {
      "phrasal_verb": "take (something) out",
      "definition": "remove something from somewhere",
      "examples": [
        "After moving house, they took out their fragile items from the boxes."
      ]
    },
    {
      "phrasal_verb": "hang (something) up",
      "definition": "suspend something above ground",
      "examples": [
        "Instead of putting wet towels on the floor, it’s better to hang them up to dry."
      ]
    }
  ],
  "Morning Routine": [
    {
      "phrasal_verb": "go off",
      "definition": "start making a noise (alarms)",
      "examples": [
        "I knew the cookies in the oven were ready when the timer went off."
      ]
    },
    {
      "phrasal_verb": "wake up",
      "definition": "open your eyes and stop sleeping",
      "examples": [
        "The smell of freshly brewed coffee is a great way to wake up."
      ]
    },
    {
      "phrasal_verb": "sleep in",
      "definition": "continue sleeping after the time you usually wake up",
      "examples": [
        "After a long week of work, Sarah allowed herself to sleep in on Saturday morning."
      ]
    },
    {
      "phrasal_verb": "get up",
      "definition": "stand up after being in bed",
      "examples": [
        "My daughter got up at 5 am because she was so excited about her birthday."
      ]
    },
    {
      "phrasal_verb": "put (something) on",
      "definition": "dress yourself in something",
      "examples": [
        "He quickly put on his running shoes and headed out for a morning jog."
      ]
    },
    {
      "phrasal_verb": "work out",
      "definition": "train the body through exercise",
      "examples": [
        "I try to work out at the gym at least three times a week."
      ]
    },
    {
      "phrasal_verb": "pick (something) out",
      "definition": "choose (something) carefully",
      "examples": [
        "Can you help me pick out a gift for my sister's birthday?"
      ]
    },
    {
      "phrasal_verb": "get dressed",
      "definition": "put on your clothes",
      "examples": [
        "I turned up to an online meeting in pyjamas because I forgot to get dressed."
      ]
    },
    {
      "phrasal_verb": "work on (something)",
      "definition": "spend time learning, studying or doing something",
      "examples": [
        "The team decided to work on the project collaboratively to achieve better results"
      ]
    }
  ],
  "Business": [
    {
      "phrasal_verb": "Close down",
      "definition": "Stop operating; cease business",
      "examples": [
        "The plant will close down at the end of the year."
      ]
    },
    {
      "phrasal_verb": "Contract out",
      "definition": "Arrange for work to be done elsewhere.",
      "examples": [
        "It would be simpler to contract out the delivery service."
      ]
    },
    {
      "phrasal_verb": "Draw up",
      "definition": "Prepare a document or plan",
      "examples": [
        "The architect has drawn up plans for the new offices."
      ]
    },
    {
      "phrasal_verb": "Fall through",
      "definition": "Fail; not happen as planned.",
      "examples": [
        "Let's hope the deal doesn't fall through ."
      ]
    },
    {
      "phrasal_verb": "Lay off",
      "definition": "Terminate employment",
      "examples": [
        "The factory plans to lay off 100 workers.."
      ]
    },
    {
      "phrasal_verb": "Open up",
      "definition": "Start doing business",
      "examples": [
        "If you plan to open up a store, a good location is essentiel. \"The country has opened up its oil industry to foreign investment."
      ]
    },
    {
      "phrasal_verb": "Phase out",
      "definition": "Gradually stop or eliminate something",
      "examples": [
        "The product will be phased out before the end of the year."
      ]
    },
    {
      "phrasal_verb": "Pull out of",
      "definition": "Withdraw; stop being involved",
      "examples": [
        "Our partner pulled out of the deal at the last minute."
      ]
    },
    {
      "phrasal_verb": "Put back",
      "definition": "Postpone to a later date.",
      "examples": [
        "The scheduled opening was put back until next month."
      ]
    },
    {
      "phrasal_verb": "Sell off",
      "definition": "Sell at a reduced porice",
      "examples": [
        "The shop is selling off all the remaining stock before closing down."
      ]
    },
    {
      "phrasal_verb": "Set up",
      "definition": "Organize or arrange something",
      "examples": [
        "Let's set up a conference call with our supplier."
      ]
    },
    {
      "phrasal_verb": "Sign up (to)",
      "definition": "Join something by registering",
      "examples": [
        "Many visitors sign up to our newsletter."
      ]
    },
    {
      "phrasal_verb": "Step down",
      "definition": "Resign from a job or position",
      "examples": [
        "The chairman was forced to step down due to bad health."
      ]
    },
    {
      "phrasal_verb": "Take off",
      "definition": "Be successful",
      "examples": [
        "The new product took off as soon as it was launched."
      ]
    },
    {
      "phrasal_verb": "Take over",
      "definition": "Take control of a company (by buying its shares)",
      "examples": [
        "The group has decided to take over one of its competitors."
      ]
    },
    {
      "phrasal_verb": "Team up (with)",
      "definition": "Join forces with someone in order to work together.",
      "examples": [
        "Teaming up with a foreign distributor should help to increase sales."
      ]
    },
    {
      "phrasal_verb": "Wind up",
      "definition": "Finish; bring to an end",
      "examples": [
        "Let's wind up the meeting. It's getting late."
      ]
    },
    {
      "phrasal_verb": "Work out",
      "definition": "Find a solution or calculate something.",
      "examples": [
        "The committee tried to work out how to solve the problem."
      ]
    },
    {
      "phrasal_verb": "Write off",
      "definition": "Cancel the record of a bad debt",
      "examples": [
        "We'll never get paid so we've decided to write off the debt."
      ]
    }
  ],
  "Sports": [
    {
      "phrasal_verb": "Catch up",
      "definition": "Go faster so that you reach the person in front of you.",
      "examples": [
        "\"He was running so fast that I couldn't catch up with him.\"."
      ]
    },
    {
      "phrasal_verb": "Cheer on",
      "definition": "Encourage (someone) with shouts or cheers.",
      "examples": [
        "Supporters gathered to cheer on the runners."
      ]
    },
    {
      "phrasal_verb": "Cool down",
      "definition": "Finish with gentle exercises to prevent injury.",
      "examples": [
        "It's important to cool down after strenuous exercise."
      ]
    },
    {
      "phrasal_verb": "Keep up (with)",
      "definition": "Maintain the same pace as someone else.",
      "examples": [
        "I did my best to keep up with the other runners."
      ]
    },
    {
      "phrasal_verb": "Join in",
      "definition": "Get involved in an activity with other people.",
      "examples": [
        "The game seemed such fun that I decided to join in ."
      ]
    },
    {
      "phrasal_verb": "Loosen up",
      "definition": "Do gentle exercises to prepare for intensive activity.",
      "examples": [
        "We watched the players loosen up before the match."
      ]
    },
    {
      "phrasal_verb": "Take up",
      "definition": "Start an activity.",
      "examples": [
        "I've decided to take up running and join the local running club."
      ]
    },
    {
      "phrasal_verb": "Warm up",
      "definition": "A gradual increase in intensity to warm the muscles.",
      "examples": [
        "It's important to warm up in order to avoid injuries."
      ]
    },
    {
      "phrasal_verb": "Wear out",
      "definition": "Become tired or exhausted.",
      "examples": [
        "The training was so intensive that I was worn out ."
      ]
    },
    {
      "phrasal_verb": "Work off",
      "definition": "Get rid of something e.g. weight or extra calories.",
      "examples": [
        "Let's go for a walk to work off all that food!"
      ]
    },
    {
      "phrasal_verb": "Work out",
      "definition": "Do exercise to stay fit or make your body strong.",
      "examples": [
        "Tom goes to the gym and works out regularly."
      ]
    }
  ],
  "Clothes": [
    {
      "phrasal_verb": "Do up",
      "definition": "Fasten an item of clothing.",
      "examples": [
        "It's cold outside so do up your coat."
      ]
    },
    {
      "phrasal_verb": "Dress up",
      "definition": "Dress in your best or nicest clothes.",
      "examples": [
        "Here I am, all dressed up and ready to go!"
      ]
    },
    {
      "phrasal_verb": "Hang out",
      "definition": "Put clothes outside to dry.",
      "examples": [
        "She washed the skirt and hung it out to dry."
      ]
    },
    {
      "phrasal_verb": "Have on",
      "definition": "Be wearing.",
      "examples": [
        "What did she have on when you saw her?\" \"A navy suit and red shoes."
      ]
    },
    {
      "phrasal_verb": "Kick off",
      "definition": "Remove your shoes quickly by shaking your feet.",
      "examples": [
        "He arrived home exhausted. He kicked off his shoes and lay down on the sofa."
      ]
    },
    {
      "phrasal_verb": "Let out",
      "definition": "Make clothing wider.",
      "examples": [
        "The skirt is tight so I'll have to have it let out ."
      ]
    },
    {
      "phrasal_verb": "Put on",
      "definition": "Dress yourself in something.",
      "examples": [
        "He put on his coat and then left the house."
      ]
    },
    {
      "phrasal_verb": "Slip on",
      "definition": "Put on something quickly and easily.",
      "examples": [
        "She slipped on a pair of comfortable jeans and went downstairs."
      ]
    },
    {
      "phrasal_verb": "Take in",
      "definition": "Make clothing narrower.",
      "examples": [
        "The dress is too wide for me but I can have it taken in ."
      ]
    },
    {
      "phrasal_verb": "Take off",
      "definition": "Remove an item of clothing.",
      "examples": [
        "Come in and take off your coat."
      ]
    },
    {
      "phrasal_verb": "Take up",
      "definition": "Make clothing shorter.",
      "examples": [
        "My dress is too long.It needs to be taken up ."
      ]
    },
    {
      "phrasal_verb": "Throw on",
      "definition": "Put on an item of clothing very quickly.",
      "examples": [
        "He threw on an old jacket and rushed out."
      ]
    },
    {
      "phrasal_verb": "Turn up",
      "definition": "Shorten the length of clothing by folding the material.",
      "examples": [
        "The sleeves are a bit long. I'm going to turn them up ."
      ]
    },
    {
      "phrasal_verb": "Zip up",
      "definition": "Fasten an item of clothing using a zip.",
      "examples": [
        "He zipped up his jacket before stepping out into the snow."
      ]
    }
  ]
}
